import pytest
from pathlib import Path
from processing.DocProcessor import DocProcessor
from dics.deserter_xls_dic import *
from processing.parsers.MLParser import MLParser
import config

class MockWorkflow:
    """Заглушка для workflow, щоб збирати статистику без бота"""

    def __init__(self):
        self.stats = type('Stats', (), {
            'attachmentWordProcessed': 0,
            'attachmentPDFProcessed': 0,
            'doc_names': []
        })


@pytest.fixture
def processor_factory():
    """Фабрика для створення процесора з різними файлами"""

    def _create_processor(file_name):
        # Шлях до тестових файлів у папці tests/data
        base_path = Path(__file__).parent / "data" / file_name
        workflow = MockWorkflow()
        return DocProcessor(workflow, str(base_path), file_name)

    return _create_processor


def test_process_doc_fedorov_simple(processor_factory):
    # Тестуємо реальний кейс Федорова (СЗЧ)
    filename = "1_25.01.2026 СЗЧ з РБпНС ББпС Федоров _доповідь.doc"
    processor = processor_factory(filename)
    result = processor.process()

    assert isinstance(result, list)
    assert len(result) > 0

    fields = result[0]

    assert fields[COLUMN_NAME] == "ФЕДОРОВ Олександр Вікторович"
    assert fields[COLUMN_TITLE] == "солдат"
    assert fields[COLUMN_ID_NUMBER] == "1234567890"
    assert fields[COLUMN_BIRTHDAY] == "26.12.1989"
    # todo assert fields[COLUMN_SUBUNIT] == "ББпС"
    assert fields[COLUMN_SERVICE_TYPE] == "призовом"
    assert fields[COLUMN_MIL_UNIT] == "А0224"
    assert fields[COLUMN_TZK] == "Олександрійським РТЦК та СП в м. Олександрія, Кіровоградської обл"
    assert fields[COLUMN_ENLISTMENT_DATE] == "22.11.2025"
    assert fields[COLUMN_SERVICE_DAYS] == 64
    assert fields[COLUMN_DESERTION_DATE] == "25.01.2026"
    assert fields[COLUMN_DESERTION_PLACE] == "РВБЗ"
    assert fields[COLUMN_DESERTION_REGION] == "Шахтарське Дніпропетровської області"
    assert "ФЕДОРОВ Олександр Вікторович" in fields[COLUMN_DESERT_CONDITIONS]
    assert "самовільно залишив" in fields[COLUMN_DESERT_CONDITIONS]
    assert fields[COLUMN_PHONE] == "0687775544"
    assert "Кіровоградська область, Олександрійський район, м. Олександрія, вул. Дружби 22, кв. 23" in fields[COLUMN_ADDRESS]
    assert fields[COLUMN_RETURN_DATE] is None
    assert fields[COLUMN_EXECUTOR] == "МОГУТОВ Ігор Миколайович"


def test_process_doc_maly_simple(processor_factory):
    # Тестуємо реальний кейс (СЗЧ)
    filename = "2_01.01.2026 СЗЧ з РВБЗ 2 сабатр САДН  МАЛИЙ Д.В.doc"
    processor = processor_factory(filename)
    result = processor.process()

    print(result)
    assert isinstance(result, list)
    assert len(result) > 0
    fields = result[0]

    assert fields[COLUMN_NAME] == "МАЛИЙ Дмитро Вадимович"
    assert fields[COLUMN_TITLE] == "солдат"
    assert fields[COLUMN_ID_NUMBER] == "3611112233"
    # Зверни увагу: у результаті '12/28/0' (ймовірно, через помилку форматування року 2000)
    # Якщо очікуємо 2000 рік, перевір функцію format_to_excel_date
    assert fields[COLUMN_BIRTHDAY] == "28.12.2000"
    assert fields[COLUMN_SUBUNIT] == "САДн"
    assert fields[COLUMN_SERVICE_TYPE] == "контрактом"
    assert fields[COLUMN_MIL_UNIT] == "А0224"
    assert fields[COLUMN_TZK] == "Покровсько-Тернівським РТЦК та СП, м. Кривий Ріг, Дніпропетровської області"
    assert fields[COLUMN_ENLISTMENT_DATE] == "23.11.2020"
    assert fields[COLUMN_SERVICE_DAYS] == 1865
    assert fields[COLUMN_DESERTION_DATE] == "01.01.2026"
    assert fields[COLUMN_DESERTION_PLACE] == "РВБЗ"
    assert fields[COLUMN_DESERTION_REGION] == "Тернівка Дніпропетровської області"
    assert "МАЛИЙ Дмитро Вадимович" in fields[COLUMN_DESERT_CONDITIONS]
    assert fields[COLUMN_PHONE] == "0969111111"
    assert "Дніпропетровська обл., м. Кривий Ріг, вул. Ф. Караманиця, буд. 11А, кв 12" in fields[COLUMN_ADDRESS]
    assert fields[COLUMN_RETURN_DATE] is None
    assert fields[COLUMN_EXECUTOR] == "БОЙКО Віктор Олександрович"

# tests error - missing one of the part in the document
def test_process_doc_maly_error_missing_4(processor_factory):
    # Тестуємо реальний кейс, де заздалегідь знаємо, що PIECE_4 буде None
    filename = "3_01.01.2026 СЗЧ з РВБЗ 2 сабатр САДН  МАЛИЙ Д.В _ error.doc"
    processor = processor_factory(filename)
    with pytest.raises(ValueError) as excinfo:
        processor.process()
    assert "❌ Частина 4 не витягнуто!" in str(excinfo.value)

# tests two persons in one document
def test_process_doc_two_persons(processor_factory):
    # Тестуємо реальний кейс Івончака та Неголюка (групове СЗЧ)
    filename = "4_31.01.2026 СЗЧ з РВЗ Івончак Д.В., Неголюк В.В. 7 дшр 2 дшб.doc"
    processor = processor_factory(filename)
    result = processor.process()
    assert isinstance(result, list)
    assert len(result) == 2  # Очікуємо двох осіб

    # --- ПЕРЕВІРКА ПЕРШОЇ ОСОБИ (ІВОНЧАК) ---
    person1 = result[0]
    assert person1['ПІБ'] == 'ІВОНЧАК Дмитро Васильович'
    assert person1['Військове звання'] == 'солдат'
    assert person1['РНОКПП'] == '3151262222'
    assert person1['Дата народження'] == '03.12.1991'
    assert person1['Підрозділ'] == '2 дшб'
    assert person1['Від служби'] == 'призовом'
    assert person1['№ телефону'] == '0962522526'
    assert person1['Адреса проживання'] == "с. Майори, вул. Паркова буд. 12 кв.1-А, Біляївський р-н, Одеська обл."
    assert person1['РТЦК'] == 'Розділянським РТЦК та СП Одеської області'
    assert person1['Дата призову на військову службу'] == '14.09.2025'
    assert person1['термін служби до СЗЧ'] == 139
    assert person1['Звідки СЗЧ'] == 'РВБЗ'

    # --- ПЕРЕВІРКА ДРУГОЇ ОСОБИ (НЕГОЛЮК) ---
    person2 = result[1]
    assert person2['ПІБ'] == 'НЕГОЛЮК Володимир Васильович'
    assert person2['Військове звання'] == 'солдат'
    assert person2['РНОКПП'] == NA
    assert person2['Дата народження'] == '29.10.1981'
    assert person2['№ телефону'] == '0987773388'
    assert "Івано-Франківська обл, Івано-Франківський район, с. Раковець, вул. Стуса 12" in person2['Адреса проживання']
    assert person2['РТЦК'] == 'Надвірнянським РТЦК та СП Івано-Франківської області'
    assert person2['Дата призову на військову службу'] == '25.10.2025'
    assert person2['термін служби до СЗЧ'] == 98
    assert person2['Звідки СЗЧ'] == 'РВБЗ'

    # --- ПЕРЕВІРКА СПІЛЬНИХ ДАНИХ ---
    for field in result:
        assert field['Військова частина'] == 'А0224'
        assert field['Дата СЗЧ'] == '31.01.2026'
        assert field['Звідки СЗЧ н.п. обл'] == 'Привовчанське Дніпропетровської області'
        assert "ІВОНЧАК" in field['Дата, час обставини та причини самовільного залишення військової частини або місця служби']
        assert "НЕГОЛЮК" in field['Дата, час обставини та причини самовільного залишення військової частини або місця служби']
        assert field['Виконавець'] == 'БЕЗКРОВНИЙ Володимир Володимирович'


def test_process_doc_tzk_is_full(processor_factory):
    # перевірка, що тцк розпарсився правильно та повно. матьйїхйоп
    filename = "5_05.02.2026 СЗЧ з РВБЗ (Гавнов В.М.) рбс 3 дшб_tzk.doc"
    processor = processor_factory(filename)
    result = processor.process()

    assert isinstance(result, list)
    assert len(result) == 1

    person = result[0]
    assert person['РТЦК'] == 'Крижопільським РТЦК та СП м. Крижопіль'

def test_process_docx_simple(processor_factory):
    # тестування парсінгу docx
    filename = "6_02.01.2026 СЗЧ відсутність на військовій службі без поважних причин (Гавнов В.Є.) 9 дшр 3 дшб.docx"
    processor = processor_factory(filename)
    result = processor.process()

    print(result)

    assert isinstance(result, list)
    assert len(result) == 1

    person = result[0]
    assert person['ПІБ'] == 'ГАВНОВ Віктор Євгенович'
    assert person['Військове звання'] == 'солдат'
    assert person['РНОКПП'] == '2232933224'
    assert person['Дата народження'] == '23.03.1968'  # m/d/yy
    assert person['Військова частина'] == 'А0224'
    assert person['Підрозділ'] == '3 дшб'
    assert person['Від служби'] == 'призовом'
    assert person['РТЦК'] == 'Шепетівським РТЦК та СП м. Шепетівка 24'
    assert person['Дата призову на військову службу'] == '24.02.2022'
    assert person['термін служби до СЗЧ'] == 1408
    assert person['Дата СЗЧ'] == '02.01.2026'
    assert person['Звідки СЗЧ н.п. обл'] == 'Вознесенське, Миколаївської області'
    assert "ГАВНОВ Віктор Євгенович" in person[
        'Дата, час обставини та причини самовільного залишення військової частини або місця служби']
    assert "73 доби" in person[
        'Дата, час обставини та причини самовільного залишення військової частини або місця служби']
    assert person['№ телефону'] == '0671118227'
    assert person['Адреса проживання'] == "Хмельницька область, Ізяславський район, с. Теліжинці, вул. Центральна, буд. 48."
    assert person['Виконавець'] == 'САМУЛІК Роман Богданович'


#################### загальне модульне тестування регекспів ##############################

def test_name_extraction(processor_factory):
    processor = processor_factory("any.docx")
    text = "ГАВНОВЄЗЕРСЬКИЙ Олег Вікторович, старший солдат, військовослужбовець військової служби за призовом, "
    res = processor._extract_name(text)
    assert "ГАВНОВЄЗЕРСЬКИЙ Олег Вікторович" in res

    text = "САЛТИКОВ-ЩЕДРІН Олег Вікторович, старший солдат, військовослужбовець військової служби за призовом, "
    res = processor._extract_name(text)
    assert "САЛТИКОВ-ЩЕДРІН Олег Вікторович" in res

    text = "САЛТИКОВ-ЩЕДРІН Олег Вікторович-Огли, старший солдат, військовослужбовець військової служби за призовом, "
    res = processor._extract_name(text)
    assert "САЛТИКОВ-ЩЕДРІН Олег Вікторович-Огли" in res

    text = "САЛТИКОВ-ЩЕДРІН Олег Вікторович-Огли-Піздик, старший солдат, військовослужбовець військової служби за призовом, "
    res = processor._extract_name(text)
    assert "САЛТИКОВ-ЩЕДРІН Олег Вікторович-Огли" in res

    text = "Салтіков Олег Вікторович, старший солдат, військовослужбовець військової служби за призовом, "
    res = processor._extract_name(text)
    assert "" in res

    text = "Текст попереду ПРОТОН Олег Вікторович, старший солдат, військовослужбовець військової служби за призовом, "
    res = processor._extract_name(text)
    assert "ПРОТОН Олег Вікторович" in res

    text = "Текст попереду ПРОТОН Олег Вікторович-Огли і пробели далі, старший солдат, військовослужбовець військової служби за призовом, "
    res = processor._extract_name(text)
    assert "ПРОТОН Олег Вікторович-Огли" in res

    text = "ГАВНОВ Назар-Іван Васильович солдат, військовослужбовець військової служби за призовом,  колишній гранатометник 7 десантно-штурмової роти 2 десантно-штурмового батальйону військової частини А0224, "
    res = processor._extract_name(text)
    assert "ГАВНОВ Назар-Іван Васильович" in res

def test_title_extraction(processor_factory):
    processor = processor_factory("any.docx")
    text = "ПУНДІК Олег Вікторович, старший солдат, військовослужбовець військової служби за призовом, "
    res = processor._extract_title(text)
    assert "старший солдат" in res

    text = "ПУНДІКА Олега Вікторовича, старшого солдату, військовослужбовець військової служби за призовом, "
    res = processor._extract_title(text)
    assert "старший солдат" in res

    text = "ПУНДІКУ Олегу Вікторовичу, солдату, військовослужбовець військової служби за призовом, "
    res = processor._extract_title(text)
    assert "солдат" in res

    text = "ПУНДІК Олег Вікторович, військовослужбовець військової служби за призовом, "
    res = processor._extract_title(text)
    assert "солдат" in res


def test_rtzk_extraction(processor_factory):
    processor = processor_factory("any.docx")
    text = "Призваний Слов'янським ТЦК 10.09.2025. РНОКПП 1234567890"
    res = processor._extract_rtzk(text)
    assert "Слов'янським ТЦК" in res

    text = "Призваний Пересипським РТЦК та СП , м. Одеса, 23.12.2024,. РНОКПП 3"
    res = processor._extract_rtzk(text)
    assert res == "Пересипським РТЦК та СП , м. Одеса"

    text = "призваний Кропивницьким РТЦК та СП, м. Кропивницький, Кіровоградська обл., 19.06.2025 року. РНОКПП 32"
    res = processor._extract_rtzk(text)
    assert res == "Кропивницьким РТЦК та СП, м. Кропивницький, Кіровоградська обл"

    text = "88 р.н.; призваний Галицько-Франківським ОРТЦК та СП 01.11.2025; адреса проживання: Льв"
    res = processor._extract_rtzk(text)
    assert res == "Галицько-Франківським ОРТЦК та СП"

    text = "неодружений. Призваний Салтівським РТЦК та СП м. Харків, 27.07"
    res = processor._extract_rtzk(text)
    assert res == "Салтівським РТЦК та СП м. Харків"

    text = "на, неодружений. Призваний Покровським РТЦК та СП, Дніпропетровської області, 06.05.2025 року. РНОКПП 333"
    res = processor._extract_rtzk(text)
    assert res == "Покровським РТЦК та СП, Дніпропетровської області"

    text = "неодружений. Призваний Салтівським ОМТЦК та СП м. Харків, 27.07"
    res = processor._extract_rtzk(text)
    assert res == "Салтівським ОМТЦК та СП м. Харків"

    text = "року народження, українець, освіта вища, неодружений. Призваний Центральним РТЦК та СП в м. Миколаїв, Миколаївської області, 06.12.2025. РНОКПП 36"
    res = processor._extract_rtzk(text)
    assert res == "Центральним РТЦК та СП в м. Миколаїв, Миколаївської області"

def test_address_extraction(processor_factory):
    processor = processor_factory("any.docx")
    text = "телефону +38(096)-896-7925. Близькі родичі: Батьки померли. Адреса реєстрації військовослужбовця: Запорізька обл, м. Василівка, вул. Кірова буд. 25."
    res = processor._extract_address(text)
    assert res == 'Запорізька обл, м. Василівка, вул. Кірова буд. 25'

    text = "Батько: Моторко Анатолій Федорович, 1959 р.н., (063)-791-89-31. Адреса проживання військовослужбовця: Миколаївська обл, с. Федорівне, вул. Степова буд. 7."
    res = processor._extract_address(text)
    assert res == 'Миколаївська обл, с. Федорівне, вул. Степова буд. 7'

    text = "ГАВНОВ Юрій Азізович, військовослужбовець військової служби за мобілізацією, стрілець-снайпер 3 аеромобільного відділення 1 аеромобільного взводу 2 аеромобільної  роти аеромобільного батальйону, 21.08.1982 року народження, українець, освіта середня спеціальна. Призваний Олександрійським РТЦК та СП м. Кіровоградської обл., 17.12.2025 року, РНОКПП 3383322233, номер мобільного телефону 068-622-22-44. Адреса проживання військовослужбовця: Кіровоградська обл., м. Олександрія, вул. Перспективна, буд. 16 кв. 52. Мати: ФІБЕРГ Марта Яківна, дані потребують уточнення. Дружина: ФІБЕРГ Катерина Валеріївна, тел. 067-964-02-74. А"
    res = processor._extract_address(text)
    assert res == 'Кіровоградська обл., м. Олександрія, вул. Перспективна, буд. 16 кв. 52'

def test_phone_extraction(processor_factory):
    processor = processor_factory("any.docx")
    text = "номер мобільного телефону (095) 64 73225. Адреса "
    res = processor._extract_phone(text)
    assert res == '0956473225'

    text = "номер мобільного телефону +380505184441. Близькі родичі:"
    res = processor._extract_phone(text)
    assert res == '0505184441'

def test_where_desertion_extraction(processor_factory):
    processor = processor_factory("any.docx")
    text = "30.01.2026 від тимчасово виконуючого обов’язки командира 4 аеромобільної роти аеромобільного батальйону надійшла доповідь про факт неповернення з лікування до району виконання завдання за призначенням військовослужбовця військової частини А0224 (без зброї)."
    file_name = '30.01.2026 СЗЧ з лікування ГАВНОВ Р.О. 4 аемр аемб.docx'
    res = processor._extract_desertion_place(text, file_name)
    assert res == 'лікування'

    text = "05.02.2026 від командира аеромобільного батальйону надійшла доповідь про факт відсутності військовослужбовця військової частини А0224 в медичному закладі куди був спрямований на стаціонарне проходження військово-лікарської комісії з пункту тимчасового розташування підрозділу с. Вознесенське Миколаївської області."
    file_name = '05.02.2026 СЗЧ з лікування ГАВНОВ В.Є. 4 аемр аемб.docx'
    res = processor._extract_desertion_place(text, file_name)
    assert res == 'лікування'

    text = "10.02.2026 року від командира 3 десантно-штурмового батальйону надійшла доповідь про факт неповернення з лікування до району виконання завдання за призначенням військовослужбовця військової частини А0224 солдата ГАВНОВА Миколи Анатолійовича. 10.02.2026року солдат ГАВНОВ Микола Анатолійович не повернувся з лікування до району виконання завдання за призначенням. Солдат ГАВНОВ Микола Анатолійович лікувався в Національному військово-медичному клінічному центрі госпіталю м. Київ з 28.01.2026 по 09.02.2026 року. На зв’язок не виходить документів, які підтверджують проходження лікування в інших медичних закладах не надав. До військової частини А0224 не повернувся. Пошук військовослужбовця в районі зосередження підрозділом в н.п. Українське Дніпропетровської області позитивного результату не приніс. Місцезнаходження військовослужбовця невідоме."
    file_name = '10.02.2026 СЗЧ неповернення з  лікування до РВБЗ (Гавнов М.А.) зрв 3 дшб(2)'
    res = processor._extract_desertion_place(text, file_name)
    assert res == 'лікування'

    text = "05.02.2026 від командира самохідного артилерійського дивізіону військової частини А0224 надійшла доповідь про факт неповернення після проходження військово-лікарської комісії до району виконання завдання за призначенням військовослужбовцем військової частини А0224."
    file_name = '08.02.2025 СЗЧ несвоєчасне прибуття ГАВНОВ О.Ю. 1 сабатр САДн.docx'
    res = processor._extract_desertion_place(text, file_name)
    assert res == 'ВЛК'

    text = "03.02.2026 старший солдат МУДІК Олександр Сергійович вибув з постійного пункту дислокації (н.п. Вознесенське Миколаївської області) військової частини А0224 (переміщення) до військової частини А5291, відповідно наказу НГШ ЗСУ №122-РС від 17.01.2026. До військової частини А5191 не прибув 04.02.2021, згідно повідомлення військової частини А5291 (акт прийому поповнення вх. №111 від 14.02.2021). До військової частини А0224 не повернувся."
    file_name = '09.02.2021 СЗЧ неприбуття (переміщення) до військової частини А5291 (Мудік О.С.) 11 дшр 3 дшб.doc'
    res = processor._extract_desertion_place(text, file_name)
    assert res == 'ППД'

    text = "03.02.2026 старший солдат МУДІК Олександр Сергійович вибув з постійного пункту дислокації (н.п. Вознесенське Миколаївської області) військової частини А0224 (переміщення) до військової частини А5291, відповідно наказу НГШ ЗСУ №122-РС від 17.01.2026. До військової частини А5191 не прибув 04.02.2021, згідно повідомлення військової частини А5291 (акт прийому поповнення вх. №111 від 14.02.2021). До військової частини А0224 не повернувся."
    file_name = '09.02.2021 СЗЧ неприбуття (переміщення) до військової частини А5291 (Мудік О.С.) 11 дшр 3 дшб.doc'
    res = processor._extract_desertion_place(text, file_name)
    assert res == 'ППД'

    text = "10.02.2026 року від командира 1 десантно-штурмового батальйону військової частини А0224 надійшла доповідь про факт повернення після самовільного залишення району виконання бойового завдання військовослужбовця військової частини А0224."
    file_name = '10.02.2026 повернення після СЗЧ з поля бою ГАВНОВ О. С. 1дшр 1дшб.doc'
    res = processor._extract_desertion_place(text, file_name)
    assert res == 'РВБЗ'

    text = "09.02.2026 року від ТВО командира 2 зведеної роти надійшла доповідь про факт не прибуття після відпустки за станом здоров'я до пункту постійної дислокації військовослужбовця військової частини А0224 .09.02.2026 року при перевірці наявності особового складу у місці розосередження особового складу н.п. Вознесенське Миколаївської області був відсутній солдат за призовом АЛЕКСЄЄВ Віталій Віталійович ( не прибув з відпустки за станом здоров’я) до ППД в/ч А0224 н.п. Вознесенське Миколаївської області. Пошук військовослужбовця в районі тимчасового місці перебування підрозділу поблизу с. Вознесенське Миколаївської області позитивного результату не приніс, на телефонні дзвінки не відповідає. Місцезнаходження військовослужбовця невідоме. Прошу вважати таким, що здійснив СЗЧ. "
    file_name = '09.02.2026 не прибутя з ВПХ 8 дшр 2 дшб  АЛЕКСЄЄВ В.В...doc'
    res = processor._extract_desertion_place(text, file_name)
    assert res == 'відпустки'

    text = "09.02.2026 року від командира 5 десантно-штурмової роти 2 десантно-штурмового батальйону надійшла доповідь про факт повернення після самовільного залишення військової частини А0224 солдата ГАВНОВА Євгенія Миколайовича. 08.02.2026 року близько 20:00 години під час перевірки наявності особового складу в районі зосередження підрозділом поблизу н.п. Бажани Дніпропетровської області було виявлено факт повернення солдата ГАВНОВА Євгенія Миколайовича, після неповернення з відпустки за станом здоров’я до району виконання завдання за призначенням 25.12.2025 року.  Решта обставин з'ясовується."
    file_name = '09.02.2026 повернення після СЗЧ 5 дшр 2 дшб ГАВНОВ Є.М.doc'
    res = processor._extract_desertion_place(text, file_name)
    assert res == 'відпустки'

def test_milsubunit_extraction(processor_factory):
    processor = processor_factory("any.docx")

    text = "ГАВНОВ Віталій Сергійович, солдат, військовослужбовець військової служби за призовом, розвідник-санітар 2 розвідувального відділення розвідувального взводу 1 десантно-штурмового батальйону військової частини А0224, 30.07.1986 року народження, українець, освіта середня . Призваний"
    file_name = '09.02.2026 СЗЧ РВБЗ ГАВНОВ А. С. РВ 1ДШБ.docx'
    res = processor._extract_military_subunit(text, file_name)
    assert res == '1 дшб'

    text = "ГАВНОВ Віталій Сергійович, військовослужбовець військової служби за призовом, оператор безпілотних літальних апаратів 2 відділення перехоплювачів безпілотних літальних апаратів 2 взводу перехоплювачів безпілотних літальних апаратів батареї перехоплювачів безпілотних літальних апаратів зенітного ракетного дивізіону військової частини А0224, 11.08.2001 року народження, Українець, освіта вища, "
    file_name = '09.02.2026_СЗЧ_з_району_ГАВНОВ_Бат_ПБпЛА_ЗРДн.docx'
    res = processor._extract_military_subunit(text, file_name)
    assert res == 'ЗРДн'

    text = "ГАВНОВ Леонід Генадійович, старший солдат, військовослужбовець військової служби за мобілізацією, старший навідник 2 артилерійського взводу 2 артилерійської батареї самохідного артилерійського дивізіону військової частини А0224"
    file_name = '09.02.2026_СЗЧ_з_РВБЗ_2_АБАТР_САДН__БІЖКО_Л.Г..doc'
    res = processor._extract_military_subunit(text, file_name)
    assert res == 'САДн'

    text = "ГАВНОВ Леонід Генадійович, старший солдат, військовослужбовець військової служби за мобілізацією, старший навідник 2 артилерійського взводу 2 артилерійської батареї самохідного артилерійського дивізіону військової частини А0224"
    file_name = '09.02.2026_СЗЧ_з_РВБЗ_2_АБАТР_БІЖКО_Л.Г..doc'
    res = processor._extract_military_subunit(text, file_name)
    assert res == 'САДн'





def test_ml(processor_factory):
    text = "НЕГОЛЮК Володимир Васильович, старший солдат, військовослужбовець військової служби за призовом, стрілець-помічник гранатометника 2  десантно-штурмового відділення 3 десантно-штурмового взводу 7 десантно-штурмової роти 2 десантно-штурмового батальйону військової частини А0224, 29.10.1981 року народження, українець, освіта вища, Національний транспортний університет м. Київ у 2010 році. Одружений. неодружений. Призваний Салтівським ВТТЦК та СП м. Харків, 25.10.2025 року. РНОКПП відомості не надано"
    parser = MLParser(model_path=config.ML_MODEL_PATH)
    extracted = parser.parse_text(text)
    assert extracted[COLUMN_TZK] == 'Салтівським ВТТЦК та СП м. Харків'
    assert extracted[COLUMN_TITLE] == 'старший солдат'
    assert extracted[COLUMN_NAME] == 'НЕГОЛЮК Володимир Васильович'

    print("Результат розпізнавання:")
    for key, value in extracted.items():
        print(f"[{key}]: {value}")


    text = "09.02.2026 року від тимчасово виконуючого обов’язки командира батальйону безпілотних систем військової частини А0224, надійшла доповідь про факт самовільного залишення району виконання завдання за призначенням військовослужбовця військової частини А0224 (без зброї). Попередньо встановлено, що особовий склад підрозділів військової частини А0224 відповідно до бойового наказу командира військової частини А0224 №3/2т від 18.01.2026 веде наступальні (штурмові) дії батальйонів I ешелону на глибину виконання найближчого та подальшого завдання при проведенні наступальних (штурмових) дій при виконанні заходів з національної безпеки та оборони, відсічі та стримуванні збройної агресії. 09.02.2026 року під час перевірки наявності особового складу був відсутній солдат за призовом ХЛОПУК Олександр Миколайович, який самовільно залишив район виконання завдання за призначенням. Пошук військовослужбовця в районі зосередження підрозділу в н.п. Шахтарське Дніпропетровської області позитивного результату не приніс. Місце знаходження військовослужбовця невідоме. Решта обставин з'ясовується."
    extracted = parser.parse_text(text)

    print("Результат розпізнавання:")
    for key, value in extracted.items():
        print(f"[{key}]: {value}")