from typing import Final, Dict, List, Tuple

# EXCEL FILE COLUMNS FOR DESERTERS (А0224 СЗЧ.XLSX)
NA : Final = '' # порожня ячейка, інформація не додана або не змогли витягнути
DEFAULT_MIL_UNIT : Final = 'А0224'

DEFAULT_REVIEW_STATUS = 'не призначено'
DEFAULT_REVIEW_STATUS_FOR_EDU_CENTER = 'призначено'
DEFAULT_SERVICE_TYPE = 'призивом'

# Відповідність назв колонок в екселі
COLUMN_INCREMEMTAL : Final = '№'
COLUMN_INSERT_DATE : Final = 'Дата внесення'
COLUMN_DESERTION_DATE : Final = 'Дата СЗЧ'
COLUMN_RAPORT_DATE : Final = 'Дата Рапорт'
COLUMN_MIL_UNIT : Final = 'Військова частина'
COLUMN_SERVICE_TYPE : Final = 'Від служби'
COLUMN_TITLE : Final = 'Військове звання'
COLUMN_TITLE_2 : Final = 'Військове звання2'
COLUMN_NAME : Final = 'ПІБ'
COLUMN_DESERTION_PLACE : Final = 'Звідки СЗЧ'
COLUMN_SUBUNIT : Final = 'Підрозділ'
COLUMN_SUBUNIT2 : Final = 'Підрозділ 2'
COLUMN_DESERTION_REGION : Final = 'Звідки СЗЧ н.п. обл'
COLUMN_BIRTHDAY : Final = 'Дата народження'
COLUMN_ID_NUMBER : Final = 'РНОКПП'
COLUMN_ENLISTMENT_DATE : Final = 'Дата призову на військову службу'
COLUMN_DESERT_CONDITIONS : Final = 'Дата, час обставини та причини самовільного залишення військової частини або місця служби'
COLUMN_BIO : Final = 'Біографічні дані, дата призову та яким РТЦК та СП Призваний'
COLUMN_TZK : Final = 'РТЦК'
COLUMN_TZK_REGION : Final = 'РТЦК Область'
COLUMN_ADDRESS : Final = 'Адреса проживання'
COLUMN_PHONE : Final = '№ телефону'
COLUMN_EXECUTOR : Final = 'Виконавець'
COLUMN_SERVICE_DAYS : Final = 'термін служби до СЗЧ'
COLUMN_RETURN_DATE : Final = 'Дата повернення до в/частини'
COLUMN_RETURN_TO_RESERVE_DATE : Final = 'Дата повернення в БРЕЗ' # використовується при пошуці останньої дати
COLUMN_DESERTION_TERM : Final = 'Кількість діб СЗЧ' # використовується в звітах

COLUMN_REVIEW_STATUS : Final = 'Стан розслідування'

PATTERN_TITLE_MAPPING: Final[Dict[str, str]] = {
    # Складні звання (спочатку перевіряємо їх, щоб не "з'їсти" частину)
    r'(?i)молодш[а-я]{1,3}\s+лейтенант[а-я]{0,3}\b': 'молодший лейтенант',
    r'(?i)старш[а-я]{1,3}\s+лейтенант[а-я]{0,3}\b': 'старший лейтенант',
    r'(?i)головн[а-я]{1,3}\s+сержант[а-я]{0,3}\b': 'головний сержант',
    r'(?i)молодш[а-я]{1,3}\s+сержант[а-я]{0,3}\b': 'молодший сержант',
    r'(?i)старш[а-я]{1,3}\s+сержант[а-я]{0,3}\b': 'старший сержант',
    r'(?i)штаб-сержант[а-я]{0,3}\b': 'штаб-сержант',
    r'(?i)старш[а-я]{1,3}\s+солдат[а-я]{0,3}\b': 'старший солдат',

    # Офіцери
    r'(?i)підполковник[а-я]{0,3}\b': 'підполковник',
    r'(?i)полковник[а-я]{0,3}\b': 'полковник',
    r'(?i)майор[ау]{0,3}\b': 'майор',
    r'(?i)капітан[а-я]{0,3}\b': 'капітан',
    r'(?i)лейтенант[а-я]{0,3}\b': 'лейтенант',

    # Рядовий та сержантський склад
    r'(?i)сержант[а-я]{0,3}\b': 'сержант',
    r'(?i)солдат[а-я]{0,3}\b': 'солдат',
    r'(?i)матрос[а-я]{0,3}\b': 'матрос',

    # Специфічні терміни
    r'(?i)військовослужбов[а-я]{2,4}': 'солдат',
    r'(?i)офіцер[а-я]{0,3}': 'офіцер',
}

# маппінг підрозділів
PATTERN_SUBUNIT_MAPPING : Final[Dict[str, str]] = {
    # Пріоритет: спочатку довші назви, потім коротші
    r'(?i)(\d+)?\s*десант(?:но)?\s*[-– ]?\s*штурмов(?:ого|ий)\s*батальйон(?:у|) ': r'\1 дшб',
    r'(?i)аеромобільн(?:ого|ий)\s*батальйон(?:у|)': 'АЕМБ',
    r'(?i)(батальйон(?:у|)\s*безпілотних\s*систем)|(\bББС\b)': 'ББС',
    r'\зенітного\s*ракетного\s*дивізіону\b': 'ЗРДн',
    r'\перехоплювачів\s*безпілотних\s*літальних\s*апаратів\b': 'ЗРДн', # 'БатПБПЛА',
    r'(?i)самохідн(?:ого|ий)\s*артилерійськ(?:ого|ий)\s*дивізіон(?:у|)': 'САДн',
    r'(?i)інженерн(?:ої|о|а)\s*[-– ]?\s*саперн(?:ої|а)\s*рот(?:и|а)': 'ІСР',
    r'(?i)(батальйону\s*логістики\b)|(\bБЛ\b)': 'БЛ',
    r'(?i)(батальйону\s*управління\b)|(\bБУ\b)': 'БУ',
    r'(?i)(радіаційного\s*[, ]?\s*хімічного\s*[, ]?\s*біологічного\s*захисту)|(\bРХБЗ\b)': 'РХБЗ',
    r'(?i)(танкової\s*роти\b)|(\bТР\b)': 'ТР',
    r'(?i)(управління)|(штабу\s*військової\s*частини)\b': 'Управління',

    r'\bРУБАК\b': 'РУБАК',
    r'\bББпС\b': 'ББС',
    r'\bТР\b': 'ТР',
    r'\bв розпорядженні\b': 'в розпорядженні',
    r'\ГІЗ\b': 'ГІЗ',
    r'\РР\b': 'РР',
    r'\РПТРК\b': 'РПТРК',
    r'\РЕБtodo\b': 'РЕБ',

    r'\МР\b': 'МР',
}

PATTERN_SUBUNIT2_MAPPING : Final[Dict[str, str]] = {
    # Пріоритет: спочатку довші назви, потім коротші
    r'(?i)(\d+)?\s*десант(?:но)?\s*[-– ]?\s*штурмов(?:ої|а)\s*рот(?:у|и)': r'\1 дшр',
    r'(?i)взвод(?:у|)\s*(радіоелектронної|радіо\s*[-– ]?\s*електронної)\s*боротьби': 'Взвод РЕБ',
    r'(?i)рот(?:у|и)\s*безпілотних\s*систем': 'РБС',
    r'(?i)рот(?:у|и)\s*безпілотних\s*наземних\s*систем': 'РБНС',
    r'(?i)відділення\s*перехоплювачів\s*безпілотних\s*літальних\s*апаратів\b': 'БатПБПЛА',
    r'(?i)(відділення|батаре(?:ї|я))\s*перехоплювачів\s*безпілотних\s*літальних\s*апаратів\b': 'БатПБПЛА',
    r'(?i)реактивн[а-яїі]{1,3}\s*артилерійськ[а-яїі]{1,3}\s*батаре[а-яїі]{1,2}\b': 'РеАБатр',
    r'(?i)(\d+)\s*артилерійськ[а-яїі]{1,3}\s+батаре[а-яії]{1,3}\b': r'\1 арт. Батарея',
    r'(?i)(\d+)?\s*аеромобільн[а-яїі]{1,3}\s+рот[а-яії]{1,2}': r'\1 аемр',
    r'(?i)розвідувальн(?:ого|е)\s*(відділенн(?:я|)|взвод(?:я|у))': 'РВ',
    r'(?i)мінометн(?:ої|а)\s*батаре(?:ї|я)': 'Мінометна батарея',
    r'(?i)(\d+)?\s*мінометного\s*взводу': r'РВП',
    r'(?i)(\d+)\s*роти\s*ударних\s*(?:безпілотних\s*)?авіаційних\s*комплексів\b': r'\1 РУБАК',
    r'(?i)(\d+)\s*взвод(?:у|)\s*ударних\s*(?:безпілотних\s*)?авіаційних\s*комплексів\b': r'\1 ВУБАК',
    r'(?i)взвод(?:у|)\s*ударних\s*(?:безпілотних\s*)?авіаційних\s*комплексів\b': r'ВУБАК',
    r'(?i)взвод(?:у|)\s*(?:безпілотних\s*)?авіаційних\s*комплексів\b': r'ВБАК',
    r'(?i)зеніт(?:но|ного)\s*[-– ]?\s*ракетн(?:ого|ий)\s*взвод(?:у|)': r'ЗРВ',
    r'(?i)(\d+)?\s*самохідн(?:ої|о|а)\s*[-– ]?\s*артилерійськ(?:ої|а)\s*батаре(?:ї|я)': r'\1 САБ',
    r'(?i)(артилерійськ(ого|ої)\s*взводу|управління\s*командира)\s*(батареї)?\s*артилерійської\s*батареї': 'Артилерійська батарея',
    r'(?i)рот(?:и|а)\s*вогневої\s*підтримки': 'РВП',
    r'(?i)рот(?:и|а)\s*протитанкових\s*ракетних\s*комплексів': 'РПРК',
    r'(?i)інженерн(?:ої|о|а)\s*[-– ]?\s*саперн(?:ої|а)\s*рот(?:и|а)': 'ІСР',
    r'(?i)інженерн(?:о|а)\s*[-– ]?\s*саперн(?:ого|а)\s*взвод(?:у|)': 'ІСВ',
    r'(?i)взвод(?:у|)\s*управління\s*командира\s*дивізіону': 'Взвод управління командира дивізіону',
    r'(?i)(відділення|майстерні)?\s*взводу\s*забезпечення': 'Взвод забезпечення',
    r'(?i)роти\s*управління\s*батальйону\s*управління': 'Рота управління',
    r'(?i)зенітн(?:ої|о|а)\s*[-– ]?\s*ракетн(?:ої|о|а)\s*[-– ]?\s*(?:артилерійської\s*)?батареї': 'ЗРБ',
    r'(?i)взвод(?:у|)\s*технічного\s*забезпечення': 'ВТЗ',
    r'(?i)взвод(?:у|)\s*матеріального\s*забезпечення': 'ВМЗ',
    r'(?i)(взвод(?:у|)|відділення)\s*зв\’язку': 'ВЗ',
    r'(?i)інструктор\s*медичного\s*пункту': 'МП',
    r'(?i)радіаційного\s*[, ]?\s*хімічного\s*[, ]?\s*біологічного\s*захисту': 'ВРХБЗ',
    r'(?i)автомобільної\s*роти\s*підвозу\s*боєприпасів': 'Автомобільна рота підвозу боєприпасів',
    r'(?i)автомобільної\s*роти': 'Автомобільна рота',
    r'(?i)штабу\s*батальйону\s*логістики': 'Управління',
    r'(?i)штабу': 'штаб',

}

# мапінг звідки тіканув
PATTERN_DESERTION_PLACE_MAPPING : Final[Dict[str, str]] = {
    r'(?i)(з|самовільного\sзалишення)\sрайон[у\s]+виконання\s+(?:бойового\s+)?(завдан[(ня|нь)\s]*)(за\s+призначенням)?': 'РВБЗ',
    r'(?i)після\s+(проходження|огляду)\s+(військово-лікарської\s+комісії|влк)': 'лікування',
    r'(?i)курсанта\s+.*?навчальної\s+роти': 'НЦ',
    r'(?i)не\s*(поверн(?:увся|ення)|прибув)\s+(з|після\w*\s*)(проходження)?\s*(влк|військово-лікарської комісії|влк|лікування)': 'лікування',
    r'(?i)з\s(пункту\sпостійної|постійного\sпункту)\sдислокації\s': 'ППД',
    r'(?i)(?:не\s*)?(?:поверн|прибу|з’яв)[а-яієїґ]{0,10}?\s+(?:з|після)\s+?відпустки': 'відпустки',
    r'(?i)TODO': 'відрядження',
}

PATTERN_RETURN_SIGN: Final[List[str]] = [
    r'(?i)(?<!не\s)(?<!не)(?:доповідь\s+про|факт)?\s*поверн(?:увся|ення)\s+'
]

# Мапінг типів служби: Регулярний вираз -> Результат
PATTERN_SERVICE_TYPE_MAPPING: Final[Dict[str, str]] = {
    r'(?i)приз[ио]вом|мобілізаці': "призивом",
    r'(?i)контрактом': "контрактом"
}

PATTERN_CLEANUP_POINTS: Final = ':;,. '
# Патерн для розділення тексту на абзаци
PATTERN_PARAGRAPH_SPLIT: Final = r'[\r\n]{2,}'


PATTERN_NAME : Final = r'\b(([А-ЩЬЮЯҐЄІЇʼ-]{3,}\s?){1,2})\s+([А-ЯҐЄІЇ][а-яґєії\']{1,}(?:-[А-ЯҐЄІЇ][а-яґєії\']{1,})?)\s+(([А-ЯҐЄІЇ][а-яґєії\-\']{2,}\s?){1,2})\b'
PATTERN_STRICT_NAME = r'^(?!(?:СМТ|ВУЛ|ОБЛ|Р-Н)\b)\b(([А-ЩЬЮЯҐЄІЇʼ-]{3,}\s?){1,2})\s+([А-ЯҐЄІЇ][а-яґєії\']{2,})\s+(([А-ЯҐЄІЇ][а-яґєії\-\']{2,}\s?){1,2})\b'

# Маркери ідентифікаційного коду
PATTERN_ID_MARKER: Final = r'(?i)(?:РНОКПП|ІПН|І\.П\.Н\.|РНОК\s*ПП)'
PATTERN_ID_ABSENCE: Final = r'(?i)(відсутн|не надано|немає|відомості)'
PATTERN_ID_DIGITS: Final = r'(\d{10})\b'
PATTERN_ID_STANDALONE: Final = r'\b([1-9]\d{9})\b'

# Повний патерн для пошуку телефону з маркером та різними форматами запису
PATTERN_PHONE = r'(?i)(?:номер|(?:ефон(у)?)|тел\.)[\s\w.:+]*?(\+?\s?3?8?[\s(-]*0\d{2}[\s)-]*[\d\s-]{7,10})\b'

# Патерн для пошуку РТЦК
# PATTERN_RTZK: Final = r'(?i)((?:[А-ЯҐЄІЇ-][^.,!?\s]*\s+){1,5}?(?:[А-ЯҐЄІЇ]{0,2}(?:ТЦК|ЦТК|ВРК))(?:\s*(?:та|&)?\s*СП)?(?:[\s,]+(?:в\s+)?(?:м\.|місто)\s+[\w\-\']+(?:\s+[\w\-\']+)*)?(?:[\s,]+[\w\-\']+\s+(?:області|обл\.?))?)'
PATTERN_RTZK: Final = (
    r'(?i)(?:Призваний\s*)((?:\d+\s+відділ(?:ом)?\s+)?[А-ЯҐЄІЇ][а-яґєії\']+(?:[-\s][А-ЯҐЄІЇ][а-яґєії\']+)*\s+(?:[ОРМТЦК]{3,5}(?:\s+та\s+СП)?)(?:[\s,]+(?:в\s+)?(?:м\.|місто|н\.п\.)?\s*[А-ЯҐЄІЇ][а-яґєії\']+(?:[-\s][А-ЯҐЄІЇ][а-яґєії\']+)*)?(?:[\s,]+[А-ЯҐЄІЇ][а-яґєії\']+(?:[-\s][А-ЯҐЄІЇ][а-яґєії\']+)*\s+(?:області|обл\.?))?)'
)

# Список "сміттєвих" патернів для очищення результату
PATTERN_RTZK_TRASH: Final[List[str]] = [
    r'(?i)призваний\s+',
    r'(?i)призвана\s+',
    r'(?i)яким\s+',
    r'(?i)на\s+військову\s+службу\s+',
    r'(?i)за\s+призовом\s+',
    r'(?i)за\s+призивом\s+',
    r'(?i)під\s+час\s+мобілізації\s+',
    r'(?i)з\s+\d{2}\.\d.2\.\d{2,4}',
    r'\s*,?\s*\d{2}\.\d{2}\.\d{2,4}.*$',
    r'(?i)^(на військову службу|призваний)\s+' # Патерн для очищення на початку рядка
]

PATTERN_RTZK_CALLED: Final =r'(?i)(на військову службу|призваний)\s+'


PATTERN_DATE: Final = r'(\d{2}\.\d{2}\.(?:\d{4}|\d{2}))'
PATTERN_BIRTHDAY: Final = PATTERN_DATE + '\s*(?:року\s+народження|р\.н\.|народження)'
PATTERN_BIRTHDAY_FALLBACK = r'\b(\d{2}\.\d{2}\.\d{4})\b'

PATTERN_DESERTION_DATE: Final = PATTERN_DATE + '(?=\s+року\s+(?:під час перевірки|був відсутній|самовільно залишив))'

PATTERN_DESERTION_CONDITIONS_ACTUAL_PART_AFTER: Final = "відсічі та стримуванні збройної агресії."
PATTERN_ADDRESS_MARKER: Final = r'Адреса\s+(?:проживання|реєстрації)'
PATTERN_ADDRESS_CLEANUP_PREFIX: Final = r'^(?:\s*військовослужбовця)?\s*:?\s*'
PATTERN_ADDRESS_CONTENT: Final = r'^((?:(?!Мати:|Батько:|Дружина:|Родичі:|Близькі|тел\.|;|\n).)+)'

PATTERN_MIL_UNIT: Final = r'\b[А-ЯA-Z]\d{4}\b'

# Маркери, що вказують на процес перевірки
# Маркери, що вказують на сам факт відсутності
PATTERN_DESERT_CHECK_MARKERS: Final[List[str]] = [
    "під час перевірки",
    "під час шикування",
    "перевірці наявності"
]
PATTERN_DESERT_ABSENCE_MARKERS: Final[List[str]] = [
    "відсутн",
    "виявлено відсутність",
    "не було в наявності",
    "не поверн",
    "не прибуття",
    "не прибув",
    "неповерненн",
    "не знаходився"
    "429 ККУ",
    "факт самовільного залишення",
    "результату не приніс"
]

# Маркери, що вказують на повернення або прибуття військовослужбовця
PATTERN_RETURN_MARKERS: Final[List[str]] = ["був присутній", "несвоєчасно прибув", "підтверджуючих документів не надав"]
PATTERN_RETURN_DATE: Final = PATTERN_DATE + '\s*(((несвоєчасно)?прибув)|(року.*? (?:був\s+присутній|несвоєчасно\s+прибув)))'


PATTERN_DESERTION_REGION_MAIN: Final = r'(?i)(?:н\.п\.|с\.|м\.|село|місто|селище|смт)\s+([А-ЯҐЄІЇ][^.;]*?(?:області|обл\.))'
PATTERN_DESERTION_REGION_BACKUP: Final = r'(?i)([А-Я][а-яіЇє]*?\s+район[у|а]\s+[А-Я][а-яіЇє]*?\s+області)'

PATTERN_REGION: Final[List[Tuple[str, str]]] = [
    (r"(?i)(Дніпро|Крив.*Ріг|Павлоград|Новомосковск)", "Дніпропетровська область"),
    (r"(?i)(Миколаїв|Вознесен|Баштан|Корабельн|Заводськ|Центральн)", "Миколаївська область"),
    (r"(?i)(Кіровоград|Кропивницьк|Олександрій|Новоукраїн)", "Кіровоградська область"),
    (r"(?i)(Львів|Стрий|Сихів|Дрогобич|Самбір)", "Львівська область"),
    (r"(?i)(Київ|Бучан|Білоцерк|Ірпінь|Бровар)", "Київська область"),
    (r"(?i)(Івано-Франків|Калуш|Коломий)", "Івано-Франківська область"),
    (r"(?i)(Чернігів|Прилук|Ріпкин)", "Чернігівська область"),
    (r"(?i)(Хмельницьк|Шепетів)", "Хмельницька область"),
    (r"(?i)(Рівн|Дубен|Дубин)", "Рівненська область"),
    (r"(?i)(Житомир|Коростишів)", "Житомирська область"),
    (r"(?i)(Одес|Роздільнян|Подільськ|Ізмаїл)", "Одеська область"),
    (r"(?i)(Волин|Луцьк|Ковель)", "Волинська область"),
    (r"(?i)(Вінниц|Крижоп)", "Вінницька область"),
    (r"(?i)(Закарпат|Ужгород|Мукачев)", "Закарпатська область"),
    (r"(?i)(Запоріз|Запоріж|Запорож)", "Запорізька область"),
    (r"(?i)(Полтав|Кременчу)", "Полтавська область"),
    (r"(?i)(Сум|Конотоп|Шостк)", "Сумська область"),
    (r"(?i)Тернопіль", "Тернопільська область"),
    (r"(?i)Харків", "Харківська область"),
    (r"(?i)Херсон", "Херсонська область"),
    (r"(?i)(Черкас|Умань)", "Черкаська область"),
    (r"(?i)Чернівець", "Чернівецька область"),
    (r"(?i)(Донецьк|Маріупол|Краматорск|Покровськ)", "Донецька область"),
    (r"(?i)Луган", "Луганська область"),
]


#### регулярки для шматків тексту ####
PATTERN_PIECE_HEADER_START : Final = 'ДОПОВІДЬ'
PATTERN_PIECE_HEADER_END : Final = r'1\.\s+Дата\s+і\s+час\s+скоєння'

PATTERN_PIECE_1_START : Final = r'матеріальна\s+та\s+моральна\s+шкода\)\.'
PATTERN_PIECE_1_END : Final = r'2\.\s+Коли,\s+яким\s+органом'

PATTERN_PIECE_3_START : Final = r'(?:Стислі демографічні дані|Адреса проживання.*?Близькі родичі|Близькі родичі.*?Адреса проживання|призваний на військову службу, освіта, сімейний стан)'
PATTERN_PIECE_3_END : Final = r'\b4[\.\s\)]+(?:Хто проводить|Службове розслідування)'

PATTERN_PIECE_4_START : Final = r'Хто проводить службове розслідування, строки його проведення\.'
PATTERN_PIECE_4_END : Final = r'5[\.\s\)]+Військове звання'
