from typing import Final, Dict, List, Tuple

# EXCEL FILE COLUMNS FOR DESERTERS (А0224 СЗЧ.XLSX)
NA : Final[str] = '' # порожня ячейка, інформація не додана або не змогли витягнути

DEFAULT_DESERTION_TYPE: Final[str] = 'СЗЧ'
DEFAULT_DESERTION_TYPE_FOR_EDU_CENTER: Final[str] = 'СЗЧ з А2900'


DEFAULT_REVIEW_STATUS: Final[str] = 'не призначено'
DEFAULT_REVIEW_STATUS_FOR_EDU_CENTER: Final[str] = 'призначено'
DEFAULT_SERVICE_TYPE: Final[str] = 'призивом'

# Відповідність назв колонок в екселі
COLUMN_INCREMENTAL : Final[str] = '№'
COLUMN_INSERT_DATE : Final[str] = 'Дата внесення'
COLUMN_DESERTION_DATE : Final[str] = 'Дата СЗЧ'
COLUMN_REPORT_DATE : Final[str] = 'Дата Рапорт'
COLUMN_MIL_UNIT : Final[str] = 'Військова частина'
COLUMN_SERVICE_TYPE : Final[str] = 'Від служби'
COLUMN_TITLE : Final[str] = 'Військове звання'
COLUMN_TITLE_2 : Final[str] = 'Військове звання2'
COLUMN_NAME : Final[str] = 'ПІБ'
COLUMN_DESERTION_PLACE : Final[str] = 'Звідки СЗЧ'
COLUMN_DESERTION_TYPE : Final[str] = 'Місцезнаходження всл.' # сзч, зі зброєю, а2900
COLUMN_SUBUNIT : Final[str] = 'Підрозділ'
COLUMN_SUBUNIT2 : Final[str] = 'Підрозділ 2'
COLUMN_DESERTION_REGION: Final[str] = 'Звідки СЗЧ обл'
COLUMN_BIRTHDAY : Final[str] = 'Дата народження'
COLUMN_ID_NUMBER : Final[str] = 'РНОКПП'
COLUMN_ENLISTMENT_DATE : Final[str] = 'Дата призову на військову службу'
COLUMN_DESERT_CONDITIONS : Final[str] = 'Дата, час обставини та причини самовільного залишення військової частини або місця служби'
COLUMN_BIO : Final[str] = 'Біографічні дані, дата призову та яким РТЦК та СП Призваний'
COLUMN_TZK : Final[str] = 'РТЦК'
COLUMN_TZK_REGION : Final[str] = 'РТЦК Область'
COLUMN_ADDRESS : Final[str] = 'Адреса проживання'
COLUMN_PHONE : Final[str] = '№ телефону'
COLUMN_EXECUTOR : Final[str] = 'Виконавець'
COLUMN_SERVICE_DAYS : Final[str] = 'термін служби до СЗЧ'
COLUMN_RETURN_DATE : Final[str] = 'Дата повернення до в/частини'

COLUMN_RETURN_TO_RESERVE_DATE: Final[str] = 'Дата повернення в БРЕЗ' # використовується при пошуці останньої дати
COLUMN_DESERTION_TERM : Final[str] = 'Кількість діб СЗЧ' # використовується в звітах
COLUMN_SUSPENDED: Final[str] = 'Призупинення військововї служби'
COLUMN_REVIEW_STATUS : Final[str] = 'Стан розслідування'
COLUMN_ORDER_ASSIGNMENT_NUMBER: Final[str] = "№ наказу (призначення)"
COLUMN_ORDER_ASSIGNMENT_DATE: Final[str] = "Дата наказу призначення с/р"
COLUMN_ORDER_RESULT_NUMBER: Final[str] = "№ наказу (результати)"
COLUMN_ORDER_RESULT_DATE: Final[str] = "Дата наказу результу с/р"
COLUMN_CC_ARTICLE: Final[str] = "Стаття ККУ"
COLUMN_KPP_NUMBER: Final[str] = "№ повідомлення про КПП"
COLUMN_KPP_DATE: Final[str] = "Дата відправки повідомлення про КПП"
COLUMN_DBR_NUMBER: Final[str] = "№ вих на ДБР"
COLUMN_DBR_DATE: Final[str] = "Дата відправки справи на ДБР"
COLUMN_ERDR_DATE: Final[str] = "Дата внесення в ЄРДР"
COLUMN_ERDR_NOTATION: Final[str] = "примітки/ ЄРДР"
COLUMN_NOTATION: Final[str] = "Примітка"
COLUMN_EXPERIENCE: Final[str] = "experienced"

OVERRIDE_COLUMNS: Final[List[str]] = [COLUMN_DESERTION_TYPE,
                                      COLUMN_REVIEW_STATUS,
                                      COLUMN_TZK_REGION,
                                      COLUMN_KPP_NUMBER,
                                      COLUMN_KPP_DATE,
                                      COLUMN_DBR_NUMBER,
                                      COLUMN_DBR_DATE,
                                      COLUMN_ERDR_DATE,
                                      COLUMN_ERDR_NOTATION]
GENERAL_FIELDS: Final[Tuple[str, ...]] = (
    COLUMN_INCREMENTAL,
    COLUMN_INSERT_DATE,
    COLUMN_DESERTION_DATE,
    COLUMN_REPORT_DATE,
    COLUMN_MIL_UNIT,
    COLUMN_SERVICE_TYPE,
    COLUMN_TITLE,
    COLUMN_TITLE_2,
    COLUMN_NAME,
    COLUMN_DESERTION_PLACE,
    COLUMN_DESERTION_TYPE,
    COLUMN_SUBUNIT,
    COLUMN_SUBUNIT2,
    COLUMN_DESERTION_REGION,
    COLUMN_BIRTHDAY,
    COLUMN_ID_NUMBER,
    COLUMN_ENLISTMENT_DATE,
    COLUMN_DESERT_CONDITIONS,
    COLUMN_BIO,
    COLUMN_TZK,
    COLUMN_TZK_REGION,
    COLUMN_ADDRESS,
    COLUMN_PHONE,
    COLUMN_EXECUTOR,
    COLUMN_SERVICE_DAYS,
    COLUMN_RETURN_DATE,
    COLUMN_RETURN_TO_RESERVE_DATE,
    COLUMN_DESERTION_TERM,
    COLUMN_SUSPENDED,
    COLUMN_REVIEW_STATUS,
    COLUMN_ORDER_ASSIGNMENT_NUMBER,
    COLUMN_ORDER_ASSIGNMENT_DATE,
    COLUMN_ORDER_RESULT_NUMBER,
    COLUMN_ORDER_RESULT_DATE,
    COLUMN_CC_ARTICLE,
    COLUMN_KPP_NUMBER,
    COLUMN_KPP_DATE,
    COLUMN_DBR_NUMBER,
    COLUMN_DBR_DATE,
    COLUMN_ERDR_DATE,
    COLUMN_ERDR_NOTATION,
    COLUMN_NOTATION,
    COLUMN_EXPERIENCE,
)


PATTERN_TITLE_MAPPING: Final[Dict[str, str]] = {

    r'(?i)солдат[а-я]{0,3}[\b,.\s]': 'солдат',
    r'(?i)сержант[а-я]{0,3}[\b,.\s]': 'сержант',
    r'(?i)матрос[а-я]{0,3}[\b,.\s]': 'матрос',
    r'(?i)прапорщик[а-я]{0,3}[\b,.\s]': 'прапорщик',

    r'(?i)старш[а-я]{1,3}\s+солдат[а-я]{0,3}[\b,.\s]': 'старший солдат',
    r'(?i)молодш[а-я]{1,3}\s+лейтенант[а-я]{0,3}[\b,.\s]': 'молодший лейтенант',
    r'(?i)старш[а-я]{1,3}\s+лейтенант[а-я]{0,3}[\b,.\s]': 'старший лейтенант',
    r'(?i)молодш[а-я]{1,3}\s+сержант[а-я]{0,3}[\b,.\s]': 'молодший сержант',
    r'(?i)майстер[\s\-]+сержант[\b,.\s]': 'майстер-сержант',

    r'(?i)старш[а-я]{1,3}\s+сержант[а-я]{0,3}[\b,.\s]': 'старший сержант',
    r'(?i)штаб-сержант[а-я]{0,3}[\b,.\s]': 'штаб-сержант',
    r'(?i)головн[а-я]{1,3}\s+сержант[а-я]{0,3}[\b,.\s]': 'головний сержант',

    # Специфічні терміни
    r'(?i)військовослужбов[а-я]{2,4}[\b,.\s]': 'солдат',
    r'(?i)рядов[а-яй]{1,3}[\b,.\s]': 'солдат',
    r'(?i)рекрут[а-я]{2,4}[\b,.\s]': 'солдат',
    r'(?i)офіцер[а-я]{0,3}[\b,.\s]': 'офіцер',

    # Офіцери
    #r'(?i)підполковник[а-я]{0,3}[\b,.\s]': 'підполковник',
    #r'(?i)полковник[а-я]{0,3}[\b,.\s]': 'полковник',
    r'(?i)майор[ау]{0,3}[\b,.\s]': 'майор',
    r'(?i)капітан[а-я]{0,3}[\b,.\s]': 'капітан',
    r'(?i)лейтенант[а-я]{0,3}[\b,.\s]': 'лейтенант',
}

# маппінг підрозділів
PATTERN_SUBUNIT_MAPPING : Final[Dict[str, str]] = {
    # Пріоритет: спочатку довші назви, потім коротші
    r'(?i)(\d+)?\s*десант(?:но)?\s*[-– ]?\s*штурмов(?:ого|ий)\s*батальйон(?:у|) ': r'\1 дшб',
    r'(?i)аеромобільн(?:ого|ий)\s*батальйон(?:у|)': 'АЕМБ',
    r'(?i)(батальйон(?:у|)\s*безпілотних\s*систем)|(\bББС\b)|(\bББпС\b)': 'ББС',
    r'\зенітного\s*ракетного\s*дивізіону\b': 'ЗРДн',
    r'\перехоплювачів\s*безпілотних\s*літальних\s*апаратів\b': 'ЗРДн', # 'БатПБПЛА',
    r'(?i)самохідн(?:ого|ий)\s*артилерійськ(?:ого|ий)\s*дивізіон(?:у|)': 'САДн',
    r'(?i)інженерн(?:ої|о|а)\s*[-– ]?\s*саперн(?:ої|а)\s*рот(?:и|а)': 'ІСР',
    r'(?i)(батальйону\s*логістики\b)|(\bБЛ\b)': 'БЛ',
    r'(?i)(батальйону\s*управління\b)|(\bБУ\b)': 'БУ',
    r'(?i)(радіаційного\s*[, ]?\s*хімічного\s*[, ]?\s*біологічного\s*захисту)|(\bРХБЗ\b)': 'РХБЗ',
    r'(?i)(танкової\s*роти\b)|(\bТР\b)': 'ТР',
    r'(?i)(управління)|(штабу\s*військової\s*частини)\b': 'Управління',
    r'(?i)солдат\s*резерву\s*запасн[ої|а]*\s*рот[и|а]*': 'Зап рота',

    r'\bРУБАК\b': 'РУБАК',
    r'\bТР\b': 'ТР',
    r'\bв розпорядженні\b': 'в розпорядженні',
    r'\ГІЗ\b': 'ГІЗ',
    r'\РР\b': 'РР',
    r'\РПТРК\b': 'РПТРК',
    r'\РЕБtodo\b': 'РЕБ',

    r'\МР\b': 'МР',
}

PATTERN_SUBUNIT2_MAPPING : Final[Dict[str, str]] = {
    # Пріоритет: спочатку довші назви, потім коротші
    r'(?i)(\d+)?\s*десант(?:но)?\s*[-– ]?\s*штурмов(?:ої|а)\s*рот(?:у|и)': r'\1 дшр',
    r'(?i)взвод(?:у|)\s*(радіоелектронної|радіо\s*[-– ]?\s*електронної)\s*боротьби': 'Взвод РЕБ',
    r'(?i)рот(?:у|и)\s*безпілотних\s*систем': 'РБС',
    r'(?i)рот(?:у|и)\s*безпілотних\s*наземних\s*систем': 'РБНС',
    r'(?i)відділення\s*перехоплювачів\s*безпілотних\s*літальних\s*апаратів\b': 'БатПБПЛА',
    r'(?i)(відділення|батаре(?:ї|я))\s*перехоплювачів\s*безпілотних\s*літальних\s*апаратів\b': 'БатПБПЛА',
    r'(?i)реактивн[а-яїі]{1,3}\s*артилерійськ[а-яїі]{1,3}\s*батаре[а-яїі]{1,2}\b': 'РеАБатр',
    r'(?i)(\d+)\s*артилерійськ[а-яїі]{1,3}\s+батаре[а-яії]{1,3}\b': r'\1 арт. Батарея',
    r'(?i)(\d+)?\s*аеромобільн[а-яїі]{1,3}\s+рот[а-яії]{1,2}': r'\1 аемр',
    r'(?i)розвідувальн(?:ого|е)\s*(відділенн(?:я|)|взвод(?:я|у))': 'РВ',
    r'(?i)мінометн(?:ої|а)\s*батаре(?:ї|я)': 'Мінометна батарея',
    r'(?i)(\d+)?\s*мінометного\s*взводу': r'РВП',
    r'(?i)(\d+)\s*роти\s*ударних\s*(?:безпілотних\s*)?авіаційних\s*комплексів\b': r'\1 РУБАК',
    r'(?i)(\d+)\s*взвод(?:у|)\s*ударних\s*(?:безпілотних\s*)?авіаційних\s*комплексів\b': r'\1 ВУБАК',
    r'(?i)взвод(?:у|)\s*ударних\s*(?:безпілотних\s*)?авіаційних\s*комплексів\b': r'ВУБАК',
    r'(?i)взвод(?:у|)\s*(?:безпілотних\s*)?авіаційних\s*комплексів\b': r'ВБАК',
    r'(?i)зеніт(?:но|ного)\s*[-– ]?\s*ракетн(?:ого|ий)\s*взвод(?:у|)': r'ЗРВ',
    r'(?i)(\d+)?\s*самохідн(?:ої|о|а)\s*[-– ]?\s*артилерійськ(?:ої|а)\s*батаре(?:ї|я)': r'\1 САБ',
    r'(?i)(артилерійськ(ого|ої)\s*взводу|управління\s*командира)\s*(батареї)?\s*артилерійської\s*батареї': 'Артилерійська батарея',
    r'(?i)рот(?:и|а)\s*вогневої\s*підтримки': 'РВП',
    r'(?i)рот(?:и|а)\s*протитанкових\s*ракетних\s*комплексів': 'РПРК',
    r'(?i)інженерн(?:ої|о|а)\s*[-– ]?\s*саперн(?:ої|а)\s*рот(?:и|а)': 'ІСР',
    r'(?i)інженерн(?:о|а)\s*[-– ]?\s*саперн(?:ого|а)\s*взвод(?:у|)': 'ІСВ',
    r'(?i)взвод(?:у|)\s*управління\s*командира\s*дивізіону': 'Взвод управління командира дивізіону',
    r'(?i)(відділення|майстерні)?\s*взводу\s*забезпечення': 'Взвод забезпечення',
    r'(?i)роти\s*управління\s*батальйону\s*управління': 'Рота управління',
    r'(?i)зенітн(?:ої|о|а)\s*[-– ]?\s*ракетн(?:ої|о|а)\s*[-– ]?\s*(?:артилерійської\s*)?батареї': 'ЗРБ',
    r'(?i)взвод(?:у|)\s*технічного\s*забезпечення': 'ВТЗ',
    r'(?i)взвод(?:у|)\s*матеріального\s*забезпечення': 'ВМЗ',
    r'(?i)(взвод(?:у|)|відділення)\s*зв\’язку': 'ВЗ',
    r'(?i)інструктор\s*медичного\s*пункту': 'МП',
    r'(?i)радіаційного\s*[, ]?\s*хімічного\s*[, ]?\s*біологічного\s*захисту': 'ВРХБЗ',
    r'(?i)автомобільної\s*роти\s*підвозу\s*боєприпасів': 'Автомобільна рота підвозу боєприпасів',
    r'(?i)автомобільної\s*роти': 'Автомобільна рота',
    r'(?i)штабу\s*батальйону\s*логістики': 'Управління',
    r'(?i)взвод(?:у|)\s*ремонтної\s*роти': 'Ремонтна рота',
    r'(?i)штабу': 'штаб',
    r'(?i)солдат\s*резерву\s*запасн[ої|а]*\s*рот[и|а]*': 'Зап рота',
}

# мапінг звідки тіканув
PATTERN_DESERTION_PLACE_MAPPING : Final[Dict[str, str]] = {
    r'(?i)(з|самовільн[(е|ого)\s]*\sзалиш[(ення|ив)\s]*)\s*район[у\s*]+виконання\s*(?:бойового\s*)?(завдан[(ня|ь)\s]*)(за\s+призначенням)?': 'РВБЗ',
    r'(?i)після\s+(проходження|огляду)\s+(військово-лікарської\s+комісії|влк)': 'лікування',
    r'(?i)(курсанта\s+.*?навчальної\s+роти|граніт|(після|з)\s+.*?БЗВП)': 'НЦ',
    r'(?i)не\s*(поверн(?:увся|ення)|прибув)\s+(з|після\w*\s*)(проходження)?\s*(влк|військово-лікарської комісії|влк|лікування)': 'лікування',
    r'(?i)з\s(пункту\sпостійної|постійного\sпункту)\sдислокації\s': 'ППД',
    r'(?i)(?:не\s*)?(?:поверн|прибу|з’яв)[а-яієїґ]{0,10}?\s+(?:з|після)\s+?відпустки': 'відпустки',
    r'(?i)(?:не\s*)?(?:поверн|прибу|з’яв)[а-яієїґ]{0,10}?\s+(?:з|після)\s+?відрядження': 'відрядження',
}

#сзч, сзч зі зброєю, а2900
PATTERN_DESERTION_TYPE_MAPPING : Final[Dict[str, str]] = {
    r'(?i)(\s+з[(і|)]?\s*(?:особист[(ою|а)\s]*\s*)?збро[(єю|я)\s]*)': "СЗЧ зброя",
    r'(?i)(відмов(?:и|а|ляється)*\s*від\s*(?:подальшого)*)': "відмова",
    r'(?i)todo': "СЗЧ з А2900",
}

PATTERN_RETURN_SIGN: Final[List[str]] = [
    r'(?i)(?<!не\s)(?<!не)(?:доповідь\s+про|факт)\s*(поверн(?:увся|ення)|присутн(?:ості|ість))\s+'
]

PATTERN_RETURN_SIGN_IN_FILE: Final[str] = r'(?<!не)(?<!не[\s_])повернення(?![\s_]+(?:особистої[\s_]+)?зброї)|відсутність(?:\s+на\s+військовій\s+службі)?\s+без\s+поважних\s+причин'

PATTERN_ERROR_SIGN: Final[List[str]] = [
    r'(?i)(?:доповідь\s+про|факт)?\s*(помилк[ового|и]+|відміни)\s+(?:повідомлення|поданих даних)?'
]

# Мапінг типів служби: Регулярний вираз -> Результат
PATTERN_SERVICE_TYPE_MAPPING: Final[Dict[str, str]] = {
    r'(?i)контрактом': "контрактом",
    r'(?i)приз[ио]вом|мобілізаці': "призивом"
}

PATTERN_CLEANUP_POINTS: Final = ':;,. '
# Патерн для розділення тексту на абзаци
PATTERN_PARAGRAPH_SPLIT: Final = r'[\r\n]{2,}'


PATTERN_NAME : Final[str] = r'(([А-ЩЬЮЯҐЄІЇ\'ʼ’-]{3,}\s?){1,2})\s+([А-ЯҐЄІЇ][а-яґєії\'ʼ’]{1,}(?:-[А-ЯҐЄІЇ][а-яґєії\'ʼ’]{1,})?)\s+(([А-ЯҐЄІЇ][а-яґєії\-\'ʼ’]{2,}\s?){1,2})'
PATTERN_STRICT_NAME:Final[str] = r'^(?!(?:СМТ|ВУЛ|ОБЛ|Р-Н)\b)\b(([А-ЩЬЮЯҐЄІЇ\'ʼ’-]{3,}\s?){1,2})\s+([А-ЯҐЄІЇ][а-яґєії\'’]{2,})\s+(([А-ЯҐЄІЇ][а-яґєії\-\'ʼ’]{2,}\s?){1,2})\b'
PATTERN_NAME_WITH_CASE:Final[str] = r'(([А-ЩЬЮЯҐЄІЇа-яґєії\'ʼ’-]{3,}\s?){1,2})\s+([А-ЯҐЄІЇ][а-яґєії\'ʼ’]{1,}(?:-[А-ЯҐЄІЇ][а-яґєії\'ʼ’]{1,})?)\s+(([А-ЯҐЄІЇ][а-яґєії\-\'ʼ’]{2,}\s?){1,2})'

# Маркери ідентифікаційного коду
PATTERN_ID_MARKER: Final = r'(?i)(?:РНОКПП|ІПН|І\.П\.Н\.|РНОК\s*ПП)'
PATTERN_ID_ABSENCE: Final = r'(?i)(відсутн|не надано|немає|відомості)'
PATTERN_ID_DIGITS: Final = r'(\d{10})\b'
PATTERN_ID_STANDALONE: Final = r'\b([1-9]\d{9})\b'

# Повний патерн для пошуку телефону з маркером та різними форматами запису
PATTERN_PHONE = r'(?i)(?e)(?:номер|моб\.?|(?:ефон(у)?)|тел\.?){e<=1}[\s\w.:+]*?([+\-\"]?\s?3?8?[\s(-]*0[\d\s-]{2}[\s)-]*[\d\s-]{7,10})\b'

# Патерн для пошуку РТЦК
# PATTERN_RTZK: Final = r'(?i)((?:[А-ЯҐЄІЇ-][^.,!?\s]*\s+){1,5}?(?:[А-ЯҐЄІЇ]{0,2}(?:ТЦК|ЦТК|ВРК))(?:\s*(?:та|&)?\s*СП)?(?:[\s,]+(?:в\s+)?(?:м\.|місто)\s+[\w\-\']+(?:\s+[\w\-\']+)*)?(?:[\s,]+[\w\-\']+\s+(?:області|обл\.?))?)'
PATTERN_RTZK: Final = (
    r"(?:Призваний[:,]?\s*)?(?:(?:\d{2}\.\d{2}\.(?:\d{4}|\d{2}))\s*(?:року|[,.:;\s*])?\s*)?((?:\d+(?:\s?-\s?[а-яіїє]*)?\s?відділ(?:ом)?\s*)?[А-ЯҐЄІЇ][а-яґєії\'ʼ’]+(?:[-\s][А-ЯҐЄІЇ][а-яґєії\'ʼ’]+)*\s+(?:[міським|обласним|районним]*\s*)(?:[ОМР]{0,2}[ТЦК]{2,3}|РВК|ОМВК|ОВК|РЦТК)(?:\s+та\s+СП)?(?:[\s,\.]*(?:(?:в\s+)?(?:м\.?|міст[о|і]|н\.п\.?)\s*)?[А-ЯҐЄІЇ][а-яґєії\'ʼ’]+(?:[-\s][А-ЯҐЄІЇ][а-яґєії\'ʼ’]+)*)*(?:[\s,]+(?:област[ьі]|обл))?)"
)

# Список "сміттєвих" патернів для очищення результату
PATTERN_RTZK_TRASH: Final[List[str]] = [
    r'(?i)призваний\s+',
    r'(?i)призвана\s+',
    r'(?i)яким\s+',
    r'(?i)на\s+військову\s+службу\s+',
    r'(?i)за\s+призовом\s+',
    r'(?i)за\s+призивом\s+',
    r'(?i)під\s+час\s+мобілізації\s+',
    r'(?i)з\s+\d{2}\.\d.2\.\d{2,4}',
    r'\s*,?\s*\d{2}\.\d{2}\.\d{2,4}.*$',
    r'(?i)^(на військову службу|призваний)\s+' # Патерн для очищення на початку рядка
]

PATTERN_ERDR:Final[str] = r'[№#]?\s*(\d{14,20})\s+від\s+(\d{2}\.\d{2}\.\d{4})'

PATTERN_RTZK_CALLED: Final =r'(?i)(ТЦК та СП|на військову службу|призваний)[,.:]?\s+'

PATTERN_DATE: Final = r"(\d{2}\.\d{2}\.(?:\d{4}|\d{2}))"

PATTERN_BIRTHDAY: Final = PATTERN_DATE + '\s*(?:року\s+народження|р\.н\.|народження)'
PATTERN_BIRTHDAY_FALLBACK = r'\b(\d{2}\.\d{2}\.\d{4})\b'

PATTERN_DESERTION_DATE: Final = PATTERN_DATE + '(?=\s+року\s+(?:під час перевірки|був відсутній|самовільно залишив))'

PATTERN_DESERTION_CONDITIONS_ACTUAL_PART_AFTER: Final = "відсічі та стримуванні збройної агресії."
PATTERN_ADDRESS_MARKER: Final = r'Адреса\s+(?:проживання|реєстрації)'
PATTERN_ADDRESS_CLEANUP_PREFIX: Final = r'^(?:\s*військовослужбовця)?\s*:?\s*'
PATTERN_ADDRESS_CONTENT: Final = r'^((?:(?!Мати:|РНОКПП|Батько:|Дружина:|Родичі:|Близькі|тел\.|;|\n).)+)'

PATTERN_MIL_UNIT: Final = r'\b[А-ЯA-Z]\d{4}\b'

VALID_PATTERN_DOC_NUM = r'^642/\d{1,5}$'
VALID_PATTERN_DOC_NUM_FULL = r'^642/\d{1,5}/\d{1,2}$'
VALID_PATTERN_PHONE= r'^(?:\+380|380|0)\d{9}$'
VALID_PATTERN_ID_NUMBER= r'^\d{10}$'
VALID_PATTERN_DATE = r'^(?:0[1-9]|[12]\d|3[01])\.(?:0[1-9]|1[0-2])\.(?:19[6-9]\d|[2-9]\d{3})$'
VALID_PATTERN_EMAIL = r'^[a-zA-Z0-9_.+-]+@[a-zA-Z0-9-]+\.[a-zA-Z0-9-.]+$'

# Маркери, що вказують на процес перевірки
# Маркери, що вказують на сам факт відсутності
PATTERN_DESERT_CHECK_MARKERS: Final[List[str]] = [
    "під час перевірки",
    "під час шикування",
    "перевірці наявності"
]
PATTERN_DESERT_ABSENCE_MARKERS: Final[List[str]] = [
    "відсутн",
    "виявлено відсутність",
    "не було в наявності",
    "не поверн",
    "пе поверн",
    "не прибуття",
    "не прибув",
    "неповерненн",
    "не знаходився"
    "429 ККУ",
    "факт самовільного залишення",
    "результату не приніс",
    "відмови від виконання бойового наказу"
]

# Маркери, що вказують на повернення або прибуття військовослужбовця
#PATTERN_RETURN_MARKERS: Final[List[str]] = ["був присутній", "несвоєчасно прибув", "підтверджуючих документів не надав"]
PATTERN_RETURN_MARKERS: Final[str] = r'(?<!\bне\s)(?<!\bне)(?:повернув(?:ся|лась)?|факт[и]?\s*повернення|прибув(?:ла)?|був\s+присутній|була\s+присутня)|несвоєчасно\s+прибув|підтверджуючих\s+документів\s+не\s+надав'
PATTERN_RETURN_DATE: Final = PATTERN_DATE + r'\s*(((несвоєчасно)?прибув)|(року.*? (?:був\s+присутній|несвоєчасно\s+прибув)))'

PATTERN_DESERTION_REGION_MAIN: Final = r'(?i)(?:н\.\s?п\.\s*|с\.\s*|м\.|населен.*\sпункт[у|а]?|село[о|а]|міст[о|а]|селищ[e|а]|смт)\s*([А-ЯҐЄІЇ][^.;]*?(?:област[і|ь]|обл\.))'
PATTERN_DESERTION_REGION_BACKUP: Final = r'(?i)([А-Я][а-яіЇє]*?\s+район[у|а]\s+[А-Я][а-яіЇє]*?\s+області)'

CITY_PRE = r"(?:(?:м\.|місто|міста|н\.п\.)\s*"
A_Z = r"[а-яії\'ʼ’]"
REGION_POST = r"(?:обл\.?|міськ[ої|а]*\s*рад[а|и]|област[іь]|(?:[ОРМТЦК]{3,5}(?:\s+та\s+СП.?)?)$))"

kyiv_c = r"(?:Ки[їє]в|Буча|Білоцерк|Ірпінь|Бровар|Голосіїв|Фастів|Бориспіль)"
kyiv_r = r"(?:(?:Ки[їє]в|Бучан|Білоцерк|Ірпін|Бровар|Голосіїв|Деснян|Фастівс|Бориспільс)"
dnipro_c = r"(?:Дніпр|Дніпропетровськ|Крив.*Ріг|Павлоград|Новомосковськ|Дніпровськ|Кам'янсь|Синельников)"
dnipro_r = r"(?:(?:Дніпр|Дніпропетровськ|Дніпровськ|Павлоград|Новомосковськ|Кам'янсь|Синельників)"
myko_c = r"(?:Микола[їє]в|Вознесен|Баштан|Корабельн|Заводськ|Інгульс)"
myko_r = r"(?:(?:Микола[їє]?в|Вознесен|Баштан|Заводськ|Інгульс)"
kiro_c = r"(?:Кіровоград|Кроп[иі]вницьк|Олександрій|Новоукраїн)"
kiro_r = r"(?:(?:К[иі]ровоград|Кроп[иі]вницьк|Олександрій|Новоукраїн)"
chernyvet_c = r"(?:Черн[іи]вц|Черн[іи]вецьк)"
chernyvet_r = r"(?:(?:Черн[іи]вц|Черн[іи]вецьк)"
lviv_c = r"(?:Львів|Стрий|Сихів|Дрогобич|Самбір|Жидачів)"
lviv_r = r"(?:(?:Львів|Стрий|Сихів|Дрогобич|Самбір|Жидачів)"
odesa_c = r"(?:Одес|Роздільн|Под[іо]льськ|Ізмаїл|Березів|Овідіопол)"
odesa_r = r"(?:(?:Одес|Роздільн|Под[іо]льськ|Ізмаїл|Березівк)"
ifr_c = r"(?:Івано[- ]?Франків|Калуш|Коломий)"
ifr_r = r"(?:(?:Івано[- ]?Франків|Калуш|Коломий)"
chern_c = r"(?:Чернігів|Прилук|Ріпкин|Ніжин)"
chern_r = r"(?:(?:Чернігів|Прилук|Ріпкин|Ніжин)"
khm_c = r"(?:Хмельницьк|Шепетів|Теофіполь)"
khm_r = r"(?:(?:Хмельницьк|Шепетів|Теофіполь)"
rovno_c = r"(?:Рівн|Дубен|Дубин|Острог)"
rovno_r = r"(?:(?:Рівнен|Дубен|Дубин|Острожс)"
zhyt_c = r"(?:Житомир|Коростишів)"
zhyt_r = r"(?:(?:Житомир|Коростишів)"
volyn_c = r"(?:Волин|Луцьк|Ковель)"
volyn_r = r"(?:(?:Волин|Луцьк|Ковель)"
vinnit_c = r"(?:Вінниц|Крижоп|Тульчин)"
vinnit_r = r"(?:(?:Вінниц|Крижоп|Тульчинс)"
zakarp_c = r"(?:Закарпат|Ужгород|Мукачев)"
zakarp_r = r"(?:(?:Закарпат|Ужгород|Мукачев)"
zaporiz_c = r"(?:Запоріз|Запоріж|Запорож)"
zaporiz_r = r"(?:(?:Запоріз|Запоріж|Запорож)"
poltava_c = r"(?:Полтав|Кременчу)"
poltava_r = r"(?:(?:Полтав|Кременчу)"
sumy_c = r"(?:Сум|Конотоп|Шостк|Охтирк)"
sumy_r = r"(?:(?:Сумс|Конотоп|Шосткінс|Охтир)"
tern_c = r"(?:Тернопіль|Тернопільськ)"
tern_r = r"(?:(?:Тернопіль|Тернопільськ)"
khark_c = r"(?:Харків)"
khark_r = r"(?:(?:Харків)"
khers_c = r"(?:Херсон)"
khers_r = r"(?:(?:Херсон)"
cherk_c = r"(?:Черкас|Умань)"
cherk_r = r"(?:(?:Черкас|Умань)"
donetsk_c = r"(?:Донецьк|Маріупол|Краматорск|Покровськ)"
donetsk_r = r"(?:(?:Донецьк|Маріупол|Краматорск|Покровськ)"
lugan_c = r"(?:Луган)"
lugan_r = r"(?:(?:Луган)"


PATTERN_REGION: Final[List[Tuple[str, str]]] = [
    (fr"(?i)({CITY_PRE}{kyiv_c}{A_Z}*)|{kyiv_r}{A_Z}*\s+{REGION_POST})", "Київська область"),
    (fr"(?i)({CITY_PRE}{dnipro_c}{A_Z}*)|{dnipro_r}{A_Z}*\s+{REGION_POST})", "Дніпропетровська область"),
    (fr"(?i)({CITY_PRE}{myko_c}{A_Z}*)|{myko_r}{A_Z}*\s+{REGION_POST})", "Миколаївська область"),
    (fr"(?i)({CITY_PRE}{kiro_c}{A_Z}*)|{kiro_r}{A_Z}*\s+{REGION_POST})", "Кіровоградська область"),
    (fr"(?i)({CITY_PRE}{chernyvet_c}{A_Z}*)|{chernyvet_r}{A_Z}*\s+{REGION_POST})", "Чернівецька область"),
    (fr"(?i)({CITY_PRE}{lviv_c}{A_Z}*)|{lviv_r}{A_Z}*\s+{REGION_POST})", "Львівська область"),
    (fr"(?i)({CITY_PRE}{odesa_c}{A_Z}*)|{odesa_r}{A_Z}*\s+{REGION_POST})", "Одеська область"),
    (fr"(?i)({CITY_PRE}{ifr_c}{A_Z}*)|{ifr_r}{A_Z}*\s+{REGION_POST})", "Івано-Франківська область"),
    (fr"(?i)({CITY_PRE}{chern_c}{A_Z}*)|{chern_r}{A_Z}*\s+{REGION_POST})", "Чернігівська область"),
    (fr"(?i)({CITY_PRE}{khm_c}{A_Z}*)|{khm_r}{A_Z}*\s+{REGION_POST})", "Хмельницька область"),
    (fr"(?i)({CITY_PRE}{rovno_c}{A_Z}*)|{rovno_r}{A_Z}*\s+{REGION_POST})", "Рівненська область"),
    (fr"(?i)({CITY_PRE}{zhyt_c}{A_Z}*)|{zhyt_r}{A_Z}*\s+{REGION_POST})", "Житомирська область"),
    (fr"(?i)({CITY_PRE}{volyn_c}{A_Z}*)|{volyn_r}{A_Z}*\s+{REGION_POST})", "Волинська область"),
    (fr"(?i)({CITY_PRE}{vinnit_c}{A_Z}*)|{vinnit_r}{A_Z}*\s+{REGION_POST})", "Вінницька область"),
    (fr"(?i)({CITY_PRE}{zakarp_c}{A_Z}*)|{zakarp_r}{A_Z}*\s+{REGION_POST})", "Закарпатська область"),
    (fr"(?i)({CITY_PRE}{zaporiz_c}{A_Z}*)|{zaporiz_r}{A_Z}*\s+{REGION_POST})", "Запорізька область"),
    (fr"(?i)({CITY_PRE}{poltava_c}{A_Z}*)|{poltava_r}{A_Z}*\s+{REGION_POST})", "Полтавська область"),
    (fr"(?i)({CITY_PRE}{sumy_c}{A_Z}*)|{sumy_r}{A_Z}*\s+{REGION_POST})", "Сумська область"),
    (fr"(?i)({CITY_PRE}{tern_c}{A_Z}*)|{tern_r}{A_Z}*\s+{REGION_POST})", "Тернопільська область"),
    (fr"(?i)({CITY_PRE}{khark_c}{A_Z}*)|{khark_r}{A_Z}*\s+{REGION_POST})", "Харківська область"),
    (fr"(?i)({CITY_PRE}{khers_c}{A_Z}*)|{khers_r}{A_Z}*\s+{REGION_POST})", "Херсонська область"),
    (fr"(?i)({CITY_PRE}{cherk_c}{A_Z}*)|{cherk_r}{A_Z}*\s+{REGION_POST})", "Черкаська область"),
    (fr"(?i)({CITY_PRE}{donetsk_c}{A_Z}*)|{donetsk_r}{A_Z}*\s+{REGION_POST})", "Донецька область"),
    (fr"(?i)({CITY_PRE}{lugan_c}{A_Z}*)|{lugan_r}{A_Z}*\s+{REGION_POST})", "Луганська область"),
]

PATTERN_LOCALITY: Final[str] = r'(?:пункт[і|у]|н\.?п\.?|міста|м.|\sс[елаоу\.]*)\s?((?:[А-ЯҐЄІЇ][а-яґєії\'ʼ’]+(?:[\s-][А-ЯҐЄІЇ][а-яґєії\'ʼ’]+)*?))[,.]?(?=\s+[А-ЯҐЄІЇ][а-яґєії]+(?:-[А-ЯҐЄІЇ][а-яґєії]+)*\s+обл[асті\.]*)'

#### регулярки для шматків тексту ####
PATTERN_PIECE_HEADER_START: Final[str] = r'(?e)(ДОПОВІДЬ){e<=1}'
PATTERN_PIECE_HEADER_END: Final[str] = r'(?e)(1. Дата і час скоєння){e<=2}'

PATTERN_PIECE_1_START: Final[str] = r'(?e)(матеріальна та моральна шкода){e<=3}'
PATTERN_PIECE_1_END: Final[str] = r'(?e)(2. Коли, яким органом){e<=2}'

PATTERN_PIECE_3_START: Final[str] = (
    r'(?e)(Стислі демографічні дані){e<=3}|'
    r'Адреса проживання.*?Близькі родичі|'
    r'Близькі родичі.*?Адреса проживання|'
    r'(?e)(призваний на військову службу, освіта, сімейний стан){e<=5}'
)
PATTERN_PIECE_3_END: Final[str] = r'(?:4[\.\s\)]*)?(?e)(Хто проводить службове розслідування, строки його проведення){e<=5}'

PATTERN_PIECE_4_START : Final[str] = r'(?e)(Хто проводить службове розслідування, строки його проведення){e<=5}'
PATTERN_PIECE_4_END: Final[str] = r'(?:5[\.\s\)]*)?(?e)(Військове звання){e<=2}.*?(?e)(безпосередніх начальників){e<=3}'

PATTERN_ERDR_CONDITIONS_START: Final[str] = (
    r'(?e)(Короткий виклад обставин){e<=2}|'
    r'(?e)(Терміново){e<=1}|'
    r'(?e)(ВИМОГА){e<=1}|'
    r'(?e)(Командиру військової частини А0224){e<=3}|'
    r'(?e)(Фабула){e<=1}'
)
PATTERN_ERDR_CONDITIONS_END: Final[str] = r'(?e)(Найменування та код ЄДР){e<=3}|(?e)(З повагою){e<=1}'
PATTERN_ERDR_CONDITIONS_NAME = r"(?:(?:[А-ЩЬЮЯҐЄІЇ][А-ЯІЇЄҐа-яіїєґ\'ʼ’-]{2,}\s?){1,2})\s+(?:[А-ЯҐЄІЇ][а-яґєії\'ʼ’]{1,}(?:-[А-ЯҐЄІЇ][а-яґєії\'ʼ’]{1,})?)\s+(?:(?:[А-ЯҐЄІЇ][а-яґєії\-\'ʼ’]{2,}\s?){1,2})"

REVIEW_STATUS_NOT_ASSIGNED: Final[str] = 'не призначено'
REVIEW_STATUS_NOT_DIRECTED: Final[str] = 'не направляємо'
REVIEW_STATUS_ASSIGNED: Final[str] = 'призначено'
REVIEW_STATUS_EXECUTING: Final[str] = 'проводяться'
REVIEW_STATUS_CLOSED: Final[str] = 'закрито'
REVIEW_STATUS_WAITING: Final[str] = 'чекаємо ЄРДР'
REVIEW_STATUS_ERROR: Final[str] = 'помилково'
REVIEW_STATUS_ERDR: Final[str] = 'ЄРДР'

REPORT_REVIEW_STATUS_NON_ERDR: Final[str] = 'не отримано витяг з ЄРДР'
REPORT_REVIEW_STATUS_ERDR: Final[str] = 'отримано витяг з ЄРДР'
REPORT_REVIEW_STATUS_NON_EVIL: Final[str] = "не є суб'єктом злочину"


REVIEW_STATUS_MAP: Final[Dict[str, List[str]]] = {
    REVIEW_STATUS_NOT_ASSIGNED: [REVIEW_STATUS_NOT_ASSIGNED],
    REVIEW_STATUS_EXECUTING: [REVIEW_STATUS_ASSIGNED],
    REVIEW_STATUS_CLOSED: [REVIEW_STATUS_CLOSED, REVIEW_STATUS_WAITING, REVIEW_STATUS_ERROR, REVIEW_STATUS_NOT_DIRECTED, REVIEW_STATUS_ERDR],
    REVIEW_STATUS_ASSIGNED: [REVIEW_STATUS_ASSIGNED],

    REPORT_REVIEW_STATUS_NON_ERDR: [REVIEW_STATUS_ASSIGNED, REVIEW_STATUS_NOT_ASSIGNED, REVIEW_STATUS_CLOSED, REVIEW_STATUS_WAITING],
    REPORT_REVIEW_STATUS_ERDR: [REVIEW_STATUS_ERDR],
    REPORT_REVIEW_STATUS_NON_EVIL: [REVIEW_STATUS_ERROR, REVIEW_STATUS_NOT_DIRECTED]

}

REPORT_SUBUNIT_EXCLUDE_ARTICLES = ['402']

SUSPENDED_KEYWORD:Final[str] = 'призупинено В/С'
DESERTION_TYPE_WEAPON_KEYWORD: Final[str] = 'СЗЧ зброя'

MIL_UNITS: Final[List[str]] = ['А0224', 'А7018']
DEFAULT_MIL_UNIT: Final[str] = MIL_UNITS[0]

EXPERIENCED_MORE_THAN_DAYS: Final[int] = 82

TASK_TYPES: Final[Dict[str, str]] = {
    'Документація': 'description',
    'Запити': 'contact_support',
    'Фікс Даних': 'bug_report',
    'Програмірувай': 'flutter_dash',
    'Звіти': 'menu_book'
}



VOC_NAMES = {
    "100": "100 - Стрілецькі та спеціальні",
    "101": "101 - Кулеметні",
    "102": "102 - Гранатометні (автоматичні)",
    "103": "103 - Гранатометні (ручні)",
    "110": "110 - Снайперські"
}

# Цей словник можна згенерувати один раз при старті або тримати в константах
VOC_KEYWORDS_MAPPING = {
    "100": ["стрілець", "штаб-сержант", "головний сержант", "командир відділення", "стрілець-вогнеметник", "стрілець-снайпер", "стрілець-помічник гранатометника", "стрілець-номер обслуги", "старший стрілець", "старший інструктор", "начальник навчального тактичного поля", "начальник стрільбища", "начальник містечка", "сержант резерву", "солдат резерву"],
    "101": ["кулеметник", "навідник-оператор", "навідник-радіотелефоніст", "навідник", "старший навідник-оператор"],
    "102": ["головний сержант-командир відділення", "старший навідник", "номер обслуги"],
    "103": ["гранатометник"]
}

REPORT_FILTER_DSB = {
    '1 дшб': ['1 дшр', '2 дшр', '3 дшр', '4 дшр'],
    '2 дшб': ['5 дшр', '6 дшр', '7 дшр', '8 дшр'],
    '3 дшб': ['9 дшр', '10 дшр', '11 дшр', '12 дшр'],
    'АЕМБ': ['1 аемр', '2 аемр', '3 аемр', '4 аемр']
}

REGEX_ANSWERS = [
    (r"(привіт|бажаю|міцного|здоров|вітаю|куку|вечір в хату|хай|доброго|добридень|бонжур)",
     ["Привіт! Що трапилося? 🤖", "Бажаю міцного! Я на зв'язку. 🫡", "Вітаю! Слухаю уважно.", "Вечір в хату", "Доброго раночку з кавочкой", "Здоровенькі були та й будьмо!"]),
    (r"(салют)",
     ["Тільки без фєєрверків!"]),

    (r"(на все добре|пока|побачення|до завтра|будьмо)",
     ["На все добре! 🤖", "Тихої ночі. 🫡", "Я пішов спатки.", "Будьмо!"]),

    (r"(спасибо|дяка|дякую|подякував|вдячний|молодець)",
     ["Я вас умоляю, куме! 🤖", "Бубьласка. 🫡", "Радий допомогти.", "Мій процесор задоволено мурчить!"]),

    (r"(як справи|шо там|як воно|як сам)",
     ["Сракопад жахливий! 🚀", "Тримаємось на багах та каві. ☕", "Все стабільно: факапи за розкладом.", "4.5.0!"]),

    (r"(хто ти|що ти за звір|ти хто|ти що)",
     ["Я бот-ботяра-саботяра, повний шаїчечки та багів. 🛠️","Налий кави, відповім", "В мене два кота!"]),

    (r"(скучно|нудно|що робити)",
     ["Знайди лопату і копай! ⛏️", "Візьми Статут, почитай на ніч.", "Почисти зброю ще раз.", "Скучно йому... Радій, що тихо!", "Запропонуй свою допомогу старшині."]),

    (r"(перемога|коли перемога|кінець війни)",
     ["Працюємо над цим кожного дня.", "Вір в Бога та ЗСУ.", "Разом і до кінця.", "Скоро. Але це не точно. 2-3 тижня (С)"]),

    (r"(капець|піпець|жесть|йомайо|бляха|пизд|)",
     ["Такова селяві, друже. 🤷‍♂️", "Тримаймо стрій, навіть якщо це повна...", "Глибше дихай.", "І не таке бувало.", "Зберись, тряпка!"]),

    (r"(допомо|help)",
     ["Ага, здайосі? Напиши 'меню' і погнали"]),

    (r"(паляниця|укрзалізниця)",
     ["Укрзалізниця! 🇺🇦"]),

    (r"(слава україні|героям слава)",
     ["Героям Слава! 🇺🇦"]),

    (r"(слава нації)",
     ["Смерть ворогам! 🇺🇦"])

]
