# EXCEL FILE COLUMNS FOR DESERTERS (А0224 СЗЧ.XLSX)

COLUMN_INCREMEMTAL = '№'
COLUMN_INSERT_DATE = 'Дата внесення'
COLUMN_DESERTION_DATE = 'Дата СЗЧ'
COLUMN_RAPORT_DATE = 'Дата Рапорт'
COLUMN_MIL_UNIT = 'Військова частина'
COLUMN_SERVICE_TYPE = 'Від служби'
COLUMN_TITLE = 'Військове звання'
COLUMN_NAME = 'ПІБ'
COLUMN_DESERTION_PLACE = 'Звідки СЗЧ'
COLUMN_SUBUNIT = 'Підрозділ'
COLUMN_SUBUNIT2 = 'Підрозділ2'
COLUMN_DESERTION_REGION = 'Звідки СЗЧ н.п. обл'
COLUMN_BIRTHDAY = 'Дата народження'
COLUMN_ID_NUMBER = 'РНОКПП'
COLUMN_ENLISTMENT_DATE = 'Дата призову на військову службу'
COLUMN_DESERT_CONDITIONS = 'Дата, час обставини та причини самовільного залишення військової частини або місця служби'
COLUMN_BIO = 'Біографічні дані, дата призову та яким РТЦК та СП Призваний'
COLUMN_TZK = 'РТЦК'
COLUMN_ADDRESS = 'Адреса проживання'
COLUMN_PHONE = '№ телефону'
COLUMN_EXECUTOR = 'Виконавець'
COLUMN_SERVICE_DAYS = 'термін служби до СЗЧ'
COLUMN_RETURN_DATE = 'Дата повернення до в/частини'

TITLES = [
            'солдат', 'старший солдат', 'молодший сержант', 'сержант',
            'старший сержант', 'головний сержант', 'штаб-сержант',
            'молодший лейтенант', 'лейтенант', 'старший лейтенант', 'капітан',
            'майор', 'підполковник', 'полковник', 'офіцер'
        ]

SUBUNIT_MAPPING = {
    # Пріоритет: спочатку довші назви, потім коротші
    r'(?i)(\d+)?\s*десант(?:но)?[- ]?штурмов(?:ого|ий)\s*батальйон(?:у|) ': r'\1 дшб',
    r'(?i)аеромобільн(?:ого|ий)\s*батальйон(?:у|)': 'АЕМБ',
    r'(?i)батальйон(?:у|)\s*безпілотних\s*систем': 'ББС',
    r'(?i)(\d+)?\s*артилерійськ(?:ої|а)\s*батареї?': r'\1 артбатарея',
    r'\bАЕМБ\b': 'АЕМБ',
    r'\b(\d+)\s*дшб\b': r'\1 дшб',
    r'\bРУБАК\b': 'РУБАК',
    r'\bББпС\b': 'ББпС',
    r'\bББС\b': 'ББС',
    r'\bТР\b': 'ТР',
    r'\bЗРАДн\b': 'ЗРАДн',
    r'\bСАДн\b': 'САДн',
    r'\bв розпорядженні\b': 'в розпорядженні',
    r'\ГІЗ\b': 'ГІЗ',
    r'\ЗРАДн\b': 'ЗРАДн',
    r'\РР\b': 'РР',
    r'\РХБЗ\b': 'РХБЗ',
    r'\САДн\b': 'САДн',
    r'\РПТРК\b': 'РПТРК',
    r'\РеАБатр\b': 'РеАБатр',
    r'\БУ\b': 'БУ',
    r'\БУтаАР\b': 'БУтаАР',
    r'\РС\b': 'РС',
    r'\РЕБ\b': 'РЕБ',
    r'\ІСР\b': 'ІСР',
    r'\Управління\b': 'Управління',
    r'\ББС\b': 'ББС',
    r'\МР\b': 'МР',

    # Додавайте нові правила сюди
}

DESERTION_PLACE_MAPPING = {
    r'(?i)район\s*виконання\s*(?:бойового\s*)?завдання': 'РВБЗ',
    r'(?i)після\s+проходження\s+військово-лікарської\s+комісії': 'відрядження',
    r'(?i)курсанта\s+.*?навчальної\s+роти': 'НЦ',
    r'(?i)не\s+повернувся\s+з\s+лікування': 'Лікування',
    r'(?i)перебування\s+підрозділу': 'ППД',
    r'(?i)після\s+огляду\s+(військово-лікарської\s+комісії|влк)': 'ВЛК',
    r'(?i)(?:повернув(?:ся|ось|нення)|неприбуття|не\s+прибув)\s+з\s+відпустки': 'Відпустки',
}


TEXT_ANCHOR_HEADER = 'ДОПОВІДЬ'

TEXT_ANCHOR_PIECE_1_START_V1 = 'та його наслідки (травми, загибель, матеріальна та моральна шкода).'
TEXT_ANCHOR_PIECE_1_END_V1 = 'та його наслідки (травми, загибель, матеріальна та моральна шкода).'

TEXT_ANCHOR_PIECE_3_START_V1 = 'Адреса проживання військовослужбовця. Близькі родичі'
TEXT_ANCHOR_PIECE_3_START_V2 = 'Близькі родичі. Адреса проживання військовослужбовця'
TEXT_ANCHOR_PIECE_3_START_V3 = 'Стислі демографічні дані'
TEXT_ANCHOR_PIECE_3_END_V1 = '4. Хто проводить службове розслідування'

TEXT_ANCHOR_PIECE_4_START_V1 = 'Хто проводить службове розслідування, строки його проведення.'
TEXT_ANCHOR_PIECE_4_END_V1 = '5. Військове звання, прізвище, '

