from typing import Final, Dict, List, Tuple

# EXCEL FILE COLUMNS FOR DESERTERS (А0224 СЗЧ.XLSX)
NA : Final = '' # порожня ячейка, інформація не додана або не змогли витягнути
DEFAULT_MIL_UNIT : Final = 'А0224'

DEFAULT_REVIEW_STATUS = 'не призначено'
DEFAULT_REVIEW_STATUS_FOR_EDU_CENTER = 'призначено'
DEFAULT_SERVICE_TYPE = 'призивом'

# Відповідність назв колонок в екселі
COLUMN_INCREMEMTAL : Final = '№'
COLUMN_INSERT_DATE : Final = 'Дата внесення'
COLUMN_DESERTION_DATE : Final = 'Дата СЗЧ'
COLUMN_RAPORT_DATE : Final = 'Дата Рапорт'
COLUMN_MIL_UNIT : Final = 'Військова частина'
COLUMN_SERVICE_TYPE : Final = 'Від служби'
COLUMN_TITLE : Final = 'Військове звання'
COLUMN_TITLE_2 : Final = 'Військове звання2'
COLUMN_NAME : Final = 'ПІБ'
COLUMN_DESERTION_PLACE : Final = 'Звідки СЗЧ'
COLUMN_DESERTION_TYPE : Final = 'Місцезнаходження всл.' # сзч, зі зброєю, а2900
COLUMN_SUBUNIT : Final = 'Підрозділ'
COLUMN_SUBUNIT2 : Final = 'Підрозділ 2'
COLUMN_DESERTION_REGION : Final = 'Звідки СЗЧ н.п. обл'
COLUMN_BIRTHDAY : Final = 'Дата народження'
COLUMN_ID_NUMBER : Final = 'РНОКПП'
COLUMN_ENLISTMENT_DATE : Final = 'Дата призову на військову службу'
COLUMN_DESERT_CONDITIONS : Final = 'Дата, час обставини та причини самовільного залишення військової частини або місця служби'
COLUMN_BIO : Final = 'Біографічні дані, дата призову та яким РТЦК та СП Призваний'
COLUMN_TZK : Final = 'РТЦК'
COLUMN_TZK_REGION : Final = 'РТЦК Область'
COLUMN_ADDRESS : Final = 'Адреса проживання'
COLUMN_PHONE : Final = '№ телефону'
COLUMN_EXECUTOR : Final = 'Виконавець'
COLUMN_SERVICE_DAYS : Final = 'термін служби до СЗЧ'
COLUMN_RETURN_DATE : Final = 'Дата повернення до в/частини'

COLUMN_RETURN_TO_RESERVE_DATE : Final = 'Дата повернення в БРЕЗ' # використовується при пошуці останньої дати
COLUMN_DESERTION_TERM : Final = 'Кількість діб СЗЧ' # використовується в звітах

COLUMN_PLACEMENT: Final = "Місцезнаходження всл."
COLUMN_REVIEW_STATUS : Final = 'Стан розслідування'
COLUMN_ORDER_ASSIGNMENT_NUMBER = "№ наказу (призначення)"
COLUMN_ORDER_ASSIGNMENT_DATE = "Дата наказу призначення с/р"
COLUMN_ORDER_RESULT_NUMBER = "№ наказу (результати)"
COLUMN_ORDER_RESULT_DATE = "Дата наказу результу с/р"
COLUMN_CC_ARTICLE = "Стаття ККУ"
COLUMN_KPP_NUMBER = "№ повідомлення про КПП"
COLUMN_KPP_DATE = "Дата відправки повідомлення про КПП"
COLUMN_DBR_NUMBER = "№ вих на ДБР"
COLUMN_DBR_DATE = "Дата відправки справи на ДБР"
COLUMN_ERDR_DATE = "Дата внесення в ЄРДР"
COLUMN_ERDR_NOTATION = "примітки/ ЄРДР"



PATTERN_TITLE_MAPPING: Final[Dict[str, str]] = {
    # Складні звання (спочатку перевіряємо їх, щоб не "з'їсти" частину)
    r'(?i)молодш[а-я]{1,3}\s+лейтенант[а-я]{0,3}\b': 'молодший лейтенант',
    r'(?i)старш[а-я]{1,3}\s+лейтенант[а-я]{0,3}\b': 'старший лейтенант',
    r'(?i)головн[а-я]{1,3}\s+сержант[а-я]{0,3}\b': 'головний сержант',
    r'(?i)молодш[а-я]{1,3}\s+сержант[а-я]{0,3}\b': 'молодший сержант',
    r'(?i)старш[а-я]{1,3}\s+сержант[а-я]{0,3}\b': 'старший сержант',
    r'(?i)штаб-сержант[а-я]{0,3}\b': 'штаб-сержант',
    r'(?i)старш[а-я]{1,3}\s+солдат[а-я]{0,3}\b': 'старший солдат',

    # Офіцери
    r'(?i)підполковник[а-я]{0,3}\b': 'підполковник',
    r'(?i)полковник[а-я]{0,3}\b': 'полковник',
    r'(?i)майор[ау]{0,3}\b': 'майор',
    r'(?i)капітан[а-я]{0,3}\b': 'капітан',
    r'(?i)лейтенант[а-я]{0,3}\b': 'лейтенант',

    # Рядовий та сержантський склад
    r'(?i)сержант[а-я]{0,3}\b': 'сержант',
    r'(?i)солдат[а-я]{0,3}\b': 'солдат',
    r'(?i)матрос[а-я]{0,3}\b': 'матрос',

    # Специфічні терміни
    r'(?i)військовослужбов[а-я]{2,4}': 'солдат',
    r'(?i)офіцер[а-я]{0,3}': 'офіцер',
}

# маппінг підрозділів
PATTERN_SUBUNIT_MAPPING : Final[Dict[str, str]] = {
    # Пріоритет: спочатку довші назви, потім коротші
    r'(?i)(\d+)?\s*десант(?:но)?\s*[-– ]?\s*штурмов(?:ого|ий)\s*батальйон(?:у|) ': r'\1 дшб',
    r'(?i)аеромобільн(?:ого|ий)\s*батальйон(?:у|)': 'АЕМБ',
    r'(?i)(батальйон(?:у|)\s*безпілотних\s*систем)|(\bББС\b)': 'ББС',
    r'\зенітного\s*ракетного\s*дивізіону\b': 'ЗРДн',
    r'\перехоплювачів\s*безпілотних\s*літальних\s*апаратів\b': 'ЗРДн', # 'БатПБПЛА',
    r'(?i)самохідн(?:ого|ий)\s*артилерійськ(?:ого|ий)\s*дивізіон(?:у|)': 'САДн',
    r'(?i)інженерн(?:ої|о|а)\s*[-– ]?\s*саперн(?:ої|а)\s*рот(?:и|а)': 'ІСР',
    r'(?i)(батальйону\s*логістики\b)|(\bБЛ\b)': 'БЛ',
    r'(?i)(батальйону\s*управління\b)|(\bБУ\b)': 'БУ',
    r'(?i)(радіаційного\s*[, ]?\s*хімічного\s*[, ]?\s*біологічного\s*захисту)|(\bРХБЗ\b)': 'РХБЗ',
    r'(?i)(танкової\s*роти\b)|(\bТР\b)': 'ТР',
    r'(?i)(управління)|(штабу\s*військової\s*частини)\b': 'Управління',

    r'\bРУБАК\b': 'РУБАК',
    r'\bББпС\b': 'ББС',
    r'\bТР\b': 'ТР',
    r'\bв розпорядженні\b': 'в розпорядженні',
    r'\ГІЗ\b': 'ГІЗ',
    r'\РР\b': 'РР',
    r'\РПТРК\b': 'РПТРК',
    r'\РЕБtodo\b': 'РЕБ',

    r'\МР\b': 'МР',
}

PATTERN_SUBUNIT2_MAPPING : Final[Dict[str, str]] = {
    # Пріоритет: спочатку довші назви, потім коротші
    r'(?i)(\d+)?\s*десант(?:но)?\s*[-– ]?\s*штурмов(?:ої|а)\s*рот(?:у|и)': r'\1 дшр',
    r'(?i)взвод(?:у|)\s*(радіоелектронної|радіо\s*[-– ]?\s*електронної)\s*боротьби': 'Взвод РЕБ',
    r'(?i)рот(?:у|и)\s*безпілотних\s*систем': 'РБС',
    r'(?i)рот(?:у|и)\s*безпілотних\s*наземних\s*систем': 'РБНС',
    r'(?i)відділення\s*перехоплювачів\s*безпілотних\s*літальних\s*апаратів\b': 'БатПБПЛА',
    r'(?i)(відділення|батаре(?:ї|я))\s*перехоплювачів\s*безпілотних\s*літальних\s*апаратів\b': 'БатПБПЛА',
    r'(?i)реактивн[а-яїі]{1,3}\s*артилерійськ[а-яїі]{1,3}\s*батаре[а-яїі]{1,2}\b': 'РеАБатр',
    r'(?i)(\d+)\s*артилерійськ[а-яїі]{1,3}\s+батаре[а-яії]{1,3}\b': r'\1 арт. Батарея',
    r'(?i)(\d+)?\s*аеромобільн[а-яїі]{1,3}\s+рот[а-яії]{1,2}': r'\1 аемр',
    r'(?i)розвідувальн(?:ого|е)\s*(відділенн(?:я|)|взвод(?:я|у))': 'РВ',
    r'(?i)мінометн(?:ої|а)\s*батаре(?:ї|я)': 'Мінометна батарея',
    r'(?i)(\d+)?\s*мінометного\s*взводу': r'РВП',
    r'(?i)(\d+)\s*роти\s*ударних\s*(?:безпілотних\s*)?авіаційних\s*комплексів\b': r'\1 РУБАК',
    r'(?i)(\d+)\s*взвод(?:у|)\s*ударних\s*(?:безпілотних\s*)?авіаційних\s*комплексів\b': r'\1 ВУБАК',
    r'(?i)взвод(?:у|)\s*ударних\s*(?:безпілотних\s*)?авіаційних\s*комплексів\b': r'ВУБАК',
    r'(?i)взвод(?:у|)\s*(?:безпілотних\s*)?авіаційних\s*комплексів\b': r'ВБАК',
    r'(?i)зеніт(?:но|ного)\s*[-– ]?\s*ракетн(?:ого|ий)\s*взвод(?:у|)': r'ЗРВ',
    r'(?i)(\d+)?\s*самохідн(?:ої|о|а)\s*[-– ]?\s*артилерійськ(?:ої|а)\s*батаре(?:ї|я)': r'\1 САБ',
    r'(?i)(артилерійськ(ого|ої)\s*взводу|управління\s*командира)\s*(батареї)?\s*артилерійської\s*батареї': 'Артилерійська батарея',
    r'(?i)рот(?:и|а)\s*вогневої\s*підтримки': 'РВП',
    r'(?i)рот(?:и|а)\s*протитанкових\s*ракетних\s*комплексів': 'РПРК',
    r'(?i)інженерн(?:ої|о|а)\s*[-– ]?\s*саперн(?:ої|а)\s*рот(?:и|а)': 'ІСР',
    r'(?i)інженерн(?:о|а)\s*[-– ]?\s*саперн(?:ого|а)\s*взвод(?:у|)': 'ІСВ',
    r'(?i)взвод(?:у|)\s*управління\s*командира\s*дивізіону': 'Взвод управління командира дивізіону',
    r'(?i)(відділення|майстерні)?\s*взводу\s*забезпечення': 'Взвод забезпечення',
    r'(?i)роти\s*управління\s*батальйону\s*управління': 'Рота управління',
    r'(?i)зенітн(?:ої|о|а)\s*[-– ]?\s*ракетн(?:ої|о|а)\s*[-– ]?\s*(?:артилерійської\s*)?батареї': 'ЗРБ',
    r'(?i)взвод(?:у|)\s*технічного\s*забезпечення': 'ВТЗ',
    r'(?i)взвод(?:у|)\s*матеріального\s*забезпечення': 'ВМЗ',
    r'(?i)(взвод(?:у|)|відділення)\s*зв\’язку': 'ВЗ',
    r'(?i)інструктор\s*медичного\s*пункту': 'МП',
    r'(?i)радіаційного\s*[, ]?\s*хімічного\s*[, ]?\s*біологічного\s*захисту': 'ВРХБЗ',
    r'(?i)автомобільної\s*роти\s*підвозу\s*боєприпасів': 'Автомобільна рота підвозу боєприпасів',
    r'(?i)автомобільної\s*роти': 'Автомобільна рота',
    r'(?i)штабу\s*батальйону\s*логістики': 'Управління',
    r'(?i)штабу': 'штаб',

}

# мапінг звідки тіканув
PATTERN_DESERTION_PLACE_MAPPING : Final[Dict[str, str]] = {
    r'(?i)(з|самовільн[(е|ого)\s]*\sзалишення)\s*район[у\s*]+виконання\s*(?:бойового\s*)?(завдан[(ня|ь)\s]*)(за\s+призначенням)?': 'РВБЗ',
    r'(?i)після\s+(проходження|огляду)\s+(військово-лікарської\s+комісії|влк)': 'лікування',
    r'(?i)курсанта\s+.*?навчальної\s+роти': 'НЦ',
    r'(?i)не\s*(поверн(?:увся|ення)|прибув)\s+(з|після\w*\s*)(проходження)?\s*(влк|військово-лікарської комісії|влк|лікування)': 'лікування',
    r'(?i)з\s(пункту\sпостійної|постійного\sпункту)\sдислокації\s': 'ППД',
    r'(?i)(?:не\s*)?(?:поверн|прибу|з’яв)[а-яієїґ]{0,10}?\s+(?:з|після)\s+?відпустки': 'відпустки',
    r'(?i)TODO': 'відрядження',
}

#сзч, сзч зі зброєю, а2900
PATTERN_DESERTION_TYPE_MAPPING : Final[Dict[str, str]] = {
    r'(?i)(\s+з[(і|)]?\s*(?:особист[(ою|а)\s]*\s*)?збро[(єю|я)\s]*)': "СЗЧ зброя",
    r'(?i)todo': "СЗЧ з А2900",
}

PATTERN_RETURN_SIGN: Final[List[str]] = [
    r'(?i)(?<!не\s)(?<!не)(?:доповідь\s+про|факт)?\s*поверн(?:увся|ення)\s+'
]

# Мапінг типів служби: Регулярний вираз -> Результат
PATTERN_SERVICE_TYPE_MAPPING: Final[Dict[str, str]] = {
    r'(?i)приз[ио]вом|мобілізаці': "призивом",
    r'(?i)контрактом': "контрактом"
}

PATTERN_CLEANUP_POINTS: Final = ':;,. '
# Патерн для розділення тексту на абзаци
PATTERN_PARAGRAPH_SPLIT: Final = r'[\r\n]{2,}'


PATTERN_NAME : Final = r'\b(([А-ЩЬЮЯҐЄІЇʼ-]{3,}\s?){1,2})\s+([А-ЯҐЄІЇ][а-яґєії\']{1,}(?:-[А-ЯҐЄІЇ][а-яґєії\']{1,})?)\s+(([А-ЯҐЄІЇ][а-яґєії\-\']{2,}\s?){1,2})\b'
PATTERN_STRICT_NAME = r'^(?!(?:СМТ|ВУЛ|ОБЛ|Р-Н)\b)\b(([А-ЩЬЮЯҐЄІЇʼ-]{3,}\s?){1,2})\s+([А-ЯҐЄІЇ][а-яґєії\']{2,})\s+(([А-ЯҐЄІЇ][а-яґєії\-\']{2,}\s?){1,2})\b'

# Маркери ідентифікаційного коду
PATTERN_ID_MARKER: Final = r'(?i)(?:РНОКПП|ІПН|І\.П\.Н\.|РНОК\s*ПП)'
PATTERN_ID_ABSENCE: Final = r'(?i)(відсутн|не надано|немає|відомості)'
PATTERN_ID_DIGITS: Final = r'(\d{10})\b'
PATTERN_ID_STANDALONE: Final = r'\b([1-9]\d{9})\b'

# Повний патерн для пошуку телефону з маркером та різними форматами запису
PATTERN_PHONE = r'(?i)(?:номер|(?:ефон(у)?)|тел\.)[\s\w.:+]*?(\+?\s?3?8?[\s(-]*0\d{2}[\s)-]*[\d\s-]{7,10})\b'

# Патерн для пошуку РТЦК
# PATTERN_RTZK: Final = r'(?i)((?:[А-ЯҐЄІЇ-][^.,!?\s]*\s+){1,5}?(?:[А-ЯҐЄІЇ]{0,2}(?:ТЦК|ЦТК|ВРК))(?:\s*(?:та|&)?\s*СП)?(?:[\s,]+(?:в\s+)?(?:м\.|місто)\s+[\w\-\']+(?:\s+[\w\-\']+)*)?(?:[\s,]+[\w\-\']+\s+(?:області|обл\.?))?)'
PATTERN_RTZK: Final = (
    r"(?i)(?:Призваний[:,]?\s*)(?:(?:\d{2}\.\d{2}\.(?:\d{4}|\d{2}))\s*(?:року)?\s*)?((?:\d+\s+відділ(?:ом)?\s+)?[А-ЯҐЄІЇ][а-яґєії\']+(?:[-\s][А-ЯҐЄІЇ][а-яґєії\']+)*\s+(?:[ОРВМТЦК]{3,5}(?:\s+та\s+СП)?)(?:[\s,]+(?:в\s+)?(?:м\.|місто|н\.п\.)?\s*[А-ЯҐЄІЇ][а-яґєії\']+(?:[-\s][А-ЯҐЄІЇ][а-яґєії\']+)*)?(?:[\s,]+[А-ЯҐЄІЇ][а-яґєії\']+(?:[-\s][А-ЯҐЄІЇ][а-яґєії\']+)*\s+(?:області|обл\.?))?)"
)

# Список "сміттєвих" патернів для очищення результату
PATTERN_RTZK_TRASH: Final[List[str]] = [
    r'(?i)призваний\s+',
    r'(?i)призвана\s+',
    r'(?i)яким\s+',
    r'(?i)на\s+військову\s+службу\s+',
    r'(?i)за\s+призовом\s+',
    r'(?i)за\s+призивом\s+',
    r'(?i)під\s+час\s+мобілізації\s+',
    r'(?i)з\s+\d{2}\.\d.2\.\d{2,4}',
    r'\s*,?\s*\d{2}\.\d{2}\.\d{2,4}.*$',
    r'(?i)^(на військову службу|призваний)\s+' # Патерн для очищення на початку рядка
]

PATTERN_RTZK_CALLED: Final =r'(?i)(на військову службу|призваний[,:]?)\s+'

PATTERN_DATE: Final = r"(\d{2}\.\d{2}\.(?:\d{4}|\d{2}))"

PATTERN_BIRTHDAY: Final = PATTERN_DATE + '\s*(?:року\s+народження|р\.н\.|народження)'
PATTERN_BIRTHDAY_FALLBACK = r'\b(\d{2}\.\d{2}\.\d{4})\b'

PATTERN_DESERTION_DATE: Final = PATTERN_DATE + '(?=\s+року\s+(?:під час перевірки|був відсутній|самовільно залишив))'

PATTERN_DESERTION_CONDITIONS_ACTUAL_PART_AFTER: Final = "відсічі та стримуванні збройної агресії."
PATTERN_ADDRESS_MARKER: Final = r'Адреса\s+(?:проживання|реєстрації)'
PATTERN_ADDRESS_CLEANUP_PREFIX: Final = r'^(?:\s*військовослужбовця)?\s*:?\s*'
PATTERN_ADDRESS_CONTENT: Final = r'^((?:(?!Мати:|Батько:|Дружина:|Родичі:|Близькі|тел\.|;|\n).)+)'

PATTERN_MIL_UNIT: Final = r'\b[А-ЯA-Z]\d{4}\b'

# Маркери, що вказують на процес перевірки
# Маркери, що вказують на сам факт відсутності
PATTERN_DESERT_CHECK_MARKERS: Final[List[str]] = [
    "під час перевірки",
    "під час шикування",
    "перевірці наявності"
]
PATTERN_DESERT_ABSENCE_MARKERS: Final[List[str]] = [
    "відсутн",
    "виявлено відсутність",
    "не було в наявності",
    "не поверн",
    "не прибуття",
    "не прибув",
    "неповерненн",
    "не знаходився"
    "429 ККУ",
    "факт самовільного залишення",
    "результату не приніс"
]

# Маркери, що вказують на повернення або прибуття військовослужбовця
PATTERN_RETURN_MARKERS: Final[List[str]] = ["був присутній", "несвоєчасно прибув", "підтверджуючих документів не надав"]
PATTERN_RETURN_DATE: Final = PATTERN_DATE + '\s*(((несвоєчасно)?прибув)|(року.*? (?:був\s+присутній|несвоєчасно\s+прибув)))'


PATTERN_DESERTION_REGION_MAIN: Final = r'(?i)(?:н\.п\.|с\.|м\.|село|місто|селище|смт)\s+([А-ЯҐЄІЇ][^.;]*?(?:області|обл\.))'
PATTERN_DESERTION_REGION_BACKUP: Final = r'(?i)([А-Я][а-яіЇє]*?\s+район[у|а]\s+[А-Я][а-яіЇє]*?\s+області)'

CITY_PRE = r"(?:(?:м\.|місто|міста|н\.п\.)\s*"
A_Z = r"[а-яії\']"
REGION_POST = r"(?:обл\.?|област[іь]|(?:[ОРМТЦК]{3,5}(?:\s+та\s+СП.?)?)$))"

kyiv_c = r"(?:Ки[їє]в|Буча|Білоцерк|Ірпінь|Бровар|Голосіїв|Фастів|Бориспіль)"
kyiv_r = r"(?:(?:Ки[їє]в|Бучан|Білоцерк|Ірпін|Бровар|Голосіїв|Деснян|Фастівс|Бориспільс)"
dnipro_c = r"(?:Дніпр|Дніпропетровськ|Крив.*Ріг|Павлоград|Новомосковськ|Дніпровськ|Кам'янсь|Синельников)"
dnipro_r = r"(?:(?:Дніпр|Дніпропетровськ|Дніпровськ|Павлоград|Новомосковськ|Кам'янсь|Синельників)"
myko_c = r"(?:Микола[їє]в|Вознесен|Баштан|Корабельн|Заводськ|Інгульс)"
myko_r = r"(?:(?:Микола[їє]?в|Вознесен|Баштан|Заводськ|Інгульс)"
kiro_c = r"(?:Кіровоград|Кроп[иі]вницьк|Олександрій|Новоукраїн)"
kiro_r = r"(?:(?:К[иі]ровоград|Кроп[иі]вницьк|Олександрій|Новоукраїн)"
chernyvet_c = r"(?:Черн[іи]вц|Черн[іи]вецьк)"
chernyvet_r = r"(?:(?:Черн[іи]вц|Черн[іи]вецьк)"
lviv_c = r"(?:Львів|Стрий|Сихів|Дрогобич|Самбір|Жидачів)"
lviv_r = r"(?:(?:Львів|Стрий|Сихів|Дрогобич|Самбір|Жидачів)"
odesa_c = r"(?:Одес|Роздільн|Под[іо]льськ|Ізмаїл|Березів)"
odesa_r = r"(?:(?:Одес|Роздільн|Под[іо]льськ|Ізмаїл|Березівк)"
ifr_c = r"(?:Івано[- ]?Франків|Калуш|Коломий)"
ifr_r = r"(?:(?:Івано[- ]?Франків|Калуш|Коломий)"
chern_c = r"(?:Чернігів|Прилук|Ріпкин)"
chern_r = r"(?:(?:Чернігів|Прилук|Ріпкин)"
khm_c = r"(?:Хмельницьк|Шепетів|Теофіполь)"
khm_r = r"(?:(?:Хмельницьк|Шепетів|Теофіполь)"
rovno_c = r"(?:Рівн|Дубен|Дубин|Острог)"
rovno_r = r"(?:(?:Рівнен|Дубен|Дубин|Острожс)"
zhyt_c = r"(?:Житомир|Коростишів)"
zhyt_r = r"(?:(?:Житомир|Коростишів)"
volyn_c = r"(?:Волин|Луцьк|Ковель)"
volyn_r = r"(?:(?:Волин|Луцьк|Ковель)"
vinnit_c = r"(?:Вінниц|Крижоп|Тульчин)"
vinnit_r = r"(?:(?:Вінниц|Крижоп|Тульчинс)"
zakarp_c = r"(?:Закарпат|Ужгород|Мукачев)"
zakarp_r = r"(?:(?:Закарпат|Ужгород|Мукачев)"
zaporiz_c = r"(?:Запоріз|Запоріж|Запорож)"
zaporiz_r = r"(?:(?:Запоріз|Запоріж|Запорож)"
poltava_c = r"(?:Полтав|Кременчу)"
poltava_r = r"(?:(?:Полтав|Кременчу)"
sumy_c = r"(?:Сум|Конотоп|Шостк|Охтирк)"
sumy_r = r"(?:(?:Сумс|Конотоп|Шосткінс|Охтир)"
tern_c = r"(?:Тернопіль|Тернопільськ)"
tern_r = r"(?:(?:Тернопіль|Тернопільськ)"
khark_c = r"(?:Харків)"
khark_r = r"(?:(?:Харків)"
khers_c = r"(?:Херсон)"
khers_r = r"(?:(?:Херсон)"
cherk_c = r"(?:Черкас|Умань)"
cherk_r = r"(?:(?:Черкас|Умань)"
donetsk_c = r"(?:Донецьк|Маріупол|Краматорск|Покровськ)"
donetsk_r = r"(?:(?:Донецьк|Маріупол|Краматорск|Покровськ)"
lugan_c = r"(?:Луган)"
lugan_r = r"(?:(?:Луган)"


PATTERN_REGION: Final[List[Tuple[str, str]]] = [
    (fr"(?i)({CITY_PRE}{kyiv_c}{A_Z}*)|{kyiv_r}{A_Z}*\s+{REGION_POST})", "Київська область"),
    (fr"(?i)({CITY_PRE}{dnipro_c}{A_Z}*)|{dnipro_r}{A_Z}*\s+{REGION_POST})", "Дніпропетровська область"),
    (fr"(?i)({CITY_PRE}{myko_c}{A_Z}*)|{myko_r}{A_Z}*\s+{REGION_POST})", "Миколаївська область"),
    (fr"(?i)({CITY_PRE}{kiro_c}{A_Z}*)|{kiro_r}{A_Z}*\s+{REGION_POST})", "Кіровоградська область"),
    (fr"(?i)({CITY_PRE}{chernyvet_c}{A_Z}*)|{chernyvet_r}{A_Z}*\s+{REGION_POST})", "Чернівецька область"),
    (fr"(?i)({CITY_PRE}{lviv_c}{A_Z}*)|{lviv_r}{A_Z}*\s+{REGION_POST})", "Львівська область"),
    (fr"(?i)({CITY_PRE}{odesa_c}{A_Z}*)|{odesa_r}{A_Z}*\s+{REGION_POST})", "Одеська область"),
    (fr"(?i)({CITY_PRE}{ifr_c}{A_Z}*)|{ifr_r}{A_Z}*\s+{REGION_POST})", "Івано-Франківська область"),
    (fr"(?i)({CITY_PRE}{chern_c}{A_Z}*)|{chern_r}{A_Z}*\s+{REGION_POST})", "Чернігівська область"),
    (fr"(?i)({CITY_PRE}{khm_c}{A_Z}*)|{khm_r}{A_Z}*\s+{REGION_POST})", "Хмельницька область"),
    (fr"(?i)({CITY_PRE}{rovno_c}{A_Z}*)|{rovno_r}{A_Z}*\s+{REGION_POST})", "Рівненська область"),
    (fr"(?i)({CITY_PRE}{zhyt_c}{A_Z}*)|{zhyt_r}{A_Z}*\s+{REGION_POST})", "Житомирська область"),
    (fr"(?i)({CITY_PRE}{volyn_c}{A_Z}*)|{volyn_r}{A_Z}*\s+{REGION_POST})", "Волинська область"),
    (fr"(?i)({CITY_PRE}{vinnit_c}{A_Z}*)|{vinnit_r}{A_Z}*\s+{REGION_POST})", "Вінницька область"),
    (fr"(?i)({CITY_PRE}{zakarp_c}{A_Z}*)|{zakarp_r}{A_Z}*\s+{REGION_POST})", "Закарпатська область"),
    (fr"(?i)({CITY_PRE}{zaporiz_c}{A_Z}*)|{zaporiz_r}{A_Z}*\s+{REGION_POST})", "Запорізька область"),
    (fr"(?i)({CITY_PRE}{poltava_c}{A_Z}*)|{poltava_r}{A_Z}*\s+{REGION_POST})", "Полтавська область"),
    (fr"(?i)({CITY_PRE}{sumy_c}{A_Z}*)|{sumy_r}{A_Z}*\s+{REGION_POST})", "Сумська область"),
    (fr"(?i)({CITY_PRE}{tern_c}{A_Z}*)|{tern_r}{A_Z}*\s+{REGION_POST})", "Тернопільська область"),
    (fr"(?i)({CITY_PRE}{khark_c}{A_Z}*)|{khark_r}{A_Z}*\s+{REGION_POST})", "Харківська область"),
    (fr"(?i)({CITY_PRE}{khers_c}{A_Z}*)|{khers_r}{A_Z}*\s+{REGION_POST})", "Херсонська область"),
    (fr"(?i)({CITY_PRE}{cherk_c}{A_Z}*)|{cherk_r}{A_Z}*\s+{REGION_POST})", "Черкаська область"),
    (fr"(?i)({CITY_PRE}{donetsk_c}{A_Z}*)|{donetsk_r}{A_Z}*\s+{REGION_POST})", "Донецька область"),
    (fr"(?i)({CITY_PRE}{lugan_c}{A_Z}*)|{lugan_r}{A_Z}*\s+{REGION_POST})", "Луганська область"),
]


#### регулярки для шматків тексту ####
PATTERN_PIECE_HEADER_START : Final = 'ДОПОВІДЬ'
PATTERN_PIECE_HEADER_END : Final = r'1\.\s+Дата\s+і\s+час\s+скоєння'

PATTERN_PIECE_1_START : Final = r'матеріальна\s+та\s+моральна\s+шкода\)\.'
PATTERN_PIECE_1_END : Final = r'2\.\s+Коли,\s+яким\s+органом'

PATTERN_PIECE_3_START : Final = r'(?:Стислі демографічні дані|Адреса проживання.*?Близькі родичі|Близькі родичі.*?Адреса проживання|призваний на військову службу, освіта, сімейний стан)'
PATTERN_PIECE_3_END : Final = r'\b4[\.\s\)]+(?:Хто проводить|Службове розслідування)'

PATTERN_PIECE_4_START : Final = r'Хто проводить службове розслідування, строки його проведення\.'
PATTERN_PIECE_4_END : Final = r'5[\.\s\)]+Військове звання'
