from typing import Final

# EXCEL FILE COLUMNS FOR DESERTERS (А0224 СЗЧ.XLSX)
NA : Final = '' # порожня ячейка, інформація не додана або не змогли витягнути
DEFAULT_MIL_UNIT : Final = 'А0224'

# Відповідність назв колонок в екселі
COLUMN_INCREMEMTAL : Final = '№'
COLUMN_INSERT_DATE : Final = 'Дата внесення'
COLUMN_DESERTION_DATE : Final = 'Дата СЗЧ'
COLUMN_RAPORT_DATE : Final = 'Дата Рапорт'
COLUMN_MIL_UNIT : Final = 'Військова частина'
COLUMN_SERVICE_TYPE : Final = 'Від служби'
COLUMN_TITLE : Final = 'Військове звання'
COLUMN_NAME : Final = 'ПІБ'
COLUMN_DESERTION_PLACE : Final = 'Звідки СЗЧ'
COLUMN_SUBUNIT : Final = 'Підрозділ'
COLUMN_SUBUNIT2 : Final = 'Підрозділ2'
COLUMN_DESERTION_REGION : Final = 'Звідки СЗЧ н.п. обл'
COLUMN_BIRTHDAY : Final = 'Дата народження'
COLUMN_ID_NUMBER : Final = 'РНОКПП'
COLUMN_ENLISTMENT_DATE : Final = 'Дата призову на військову службу'
COLUMN_DESERT_CONDITIONS : Final = 'Дата, час обставини та причини самовільного залишення військової частини або місця служби'
COLUMN_BIO : Final = 'Біографічні дані, дата призову та яким РТЦК та СП Призваний'
COLUMN_TZK : Final = 'РТЦК'
COLUMN_ADDRESS : Final = 'Адреса проживання'
COLUMN_PHONE : Final = '№ телефону'
COLUMN_EXECUTOR : Final = 'Виконавець'
COLUMN_SERVICE_DAYS : Final = 'термін служби до СЗЧ'
COLUMN_RETURN_DATE : Final = 'Дата повернення до в/частини'

# ранги
TITLES : Final = [
            'солдат', 'старший солдат', 'молодший сержант', 'сержант',
            'старший сержант', 'головний сержант', 'штаб-сержант',
            'молодший лейтенант', 'лейтенант', 'старший лейтенант', 'капітан',
            'майор', 'підполковник', 'полковник', 'офіцер'
        ]
# маппінг підрозділів
SUBUNIT_MAPPING : Final = {
    # Пріоритет: спочатку довші назви, потім коротші
    r'(?i)(\d+)?\s*десант(?:но)?[- ]?штурмов(?:ого|ий)\s*батальйон(?:у|) ': r'\1 дшб',
    r'(?i)аеромобільн(?:ого|ий)\s*батальйон(?:у|)': 'АЕМБ',
    r'(?i)батальйон(?:у|)\s*безпілотних\s*систем': 'ББС',
    r'(?i)(\d+)?\s*артилерійськ(?:ої|а)\s*батареї?': r'\1 артбатарея',
    r'\bАЕМБ\b': 'АЕМБ',
    r'\b(\d+)\s*дшб\b': r'\1 дшб',
    r'\bРУБАК\b': 'РУБАК',
    r'\bББпС\b': 'ББпС',
    r'\bББС\b': 'ББС',
    r'\bТР\b': 'ТР',
    r'\bЗРАДн\b': 'ЗРАДн',
    r'\bСАДн\b': 'САДн',
    r'\bв розпорядженні\b': 'в розпорядженні',
    r'\ГІЗ\b': 'ГІЗ',
    r'\ЗРАДн\b': 'ЗРАДн',
    r'\РР\b': 'РР',
    r'\РХБЗ\b': 'РХБЗ',
    r'\САДн\b': 'САДн',
    r'\РПТРК\b': 'РПТРК',
    r'\РеАБатр\b': 'РеАБатр',
    r'\БУ\b': 'БУ',
    r'\БУтаАР\b': 'БУтаАР',
    r'\РС\b': 'РС',
    r'\РЕБ\b': 'РЕБ',
    r'\ІСР\b': 'ІСР',
    r'\Управління\b': 'Управління',
    r'\ББС\b': 'ББС',
    r'\МР\b': 'МР',
}

# мапінг звідки тіканув
DESERTION_PLACE_MAPPING : Final = {
    r'(?i)район[у\s]+виконання\s+(?:бойового\s+)?(завдан[(ня|нь)\s]*)(за\s+призначенням)?': 'РВБЗ',
    r'(?i)після\s+проходження\s+військово-лікарської\s+комісії': 'відрядження',
    r'(?i)курсанта\s+.*?навчальної\s+роти': 'НЦ',
    r'(?i)не\s+повернувся\s+з\s+лікування': 'Лікування',
    r'(?i)перебування\s+підрозділу': 'ППД',
    r'(?i)після\s+огляду\s+(військово-лікарської\s+комісії|влк)': 'ВЛК',
    r'(?i)(?:повернув(?:ся|ось|нення)|неприбуття|не\s+прибув)\s+з\s+відпустки': 'Відпустки',
}

#### регулярки для конкретних полів ###
NAME_PATTERN : Final = r'\b(([А-ЩЬЮЯҐЄІЇʼ-]{3,}\s?){1,2})\s+([А-ЯҐЄІЇ][а-яґєії\']{2,})\s+(([А-ЯҐЄІЇ][а-яґєії\-\']{2,}\s?){1,2})\b'
STRICT_NAME_PATTERN : Final = r'^\b(([А-ЩЬЮЯҐЄІЇʼ-]{3,}\s?){1,2})\s+([А-ЯҐЄІЇ][а-яґєії\']{2,})\s+(([А-ЯҐЄІЇ][а-яґєії\-\']{2,}\s?){1,2})\b'

#### регулярки для шматків тексту ####
PATTERN_PIECE_HEADER_START : Final = 'ДОПОВІДЬ'
PATTERN_PIECE_HEADER_END : Final = r'1\.\s+Дата\s+і\s+час\s+скоєння'

PATTERN_PIECE_1_START : Final = r'матеріальна\s+та\s+моральна\s+шкода\)\.'
PATTERN_PIECE_1_END : Final = r'2\.\s+Коли,\s+яким\s+органом'

PATTERN_PIECE_3_START : Final = r'(?:Стислі демографічні дані|Адреса проживання.*?Близькі родичі|Близькі родичі.*?Адреса проживання|призваний на військову службу, освіта, сімейний стан)'
PATTERN_PIECE_3_END : Final = r'\b4[\.\s\)]+(?:Хто проводить|Службове розслідування)'

PATTERN_PIECE_4_START : Final = r'Хто проводить службове розслідування, строки його проведення\.'
PATTERN_PIECE_4_END : Final = r'5[\.\s\)]+Військове звання'
